{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 3,
    "last_updated": "2026-01-22T19:43:38.993805",
    "severity_distribution": {
      "critical": 1,
      "high": 0,
      "medium": 1,
      "low": 1,
      "none": 0
    }
  },
  "cves": [
    {
      "id": "CVE-2026-21962",
      "publishedDate": "2026-01-20T21:56:32.665Z",
      "lastModifiedDate": "2026-01-22T19:37:18.644Z",
      "description": "Vulnerability in the Oracle HTTP Server, Oracle Weblogic Server Proxy Plug-in product of Oracle Fusion Middleware (component: Weblogic Server Proxy Plug-in for Apache HTTP Server, Weblogic Server Proxy Plug-in for IIS).  Supported versions that are affected are 12.2.1.4.0, 14.1.1.0.0 and  14.1.2.0.0. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle HTTP Server, Oracle Weblogic Server Proxy Plug-in.  While the vulnerability is in Oracle HTTP Server, Oracle Weblogic Server Proxy Plug-in, attacks may significantly impact additional products (scope change).  Successful attacks of this vulnerability can result in  unauthorized creation, deletion or modification access to critical data or all Oracle HTTP Server, Oracle Weblogic Server Proxy Plug-in accessible data as well as  unauthorized access to critical data or complete access to all Oracle HTTP Server, Oracle Weblogic Server Proxy Plug-in accessible data. Note: Affected version for Weblogic Server Proxy Plug-in for IIS is 12.2.1.4.0 only. CVSS 3.1 Base Score 10.0 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:N).",
      "severity": 10,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpujan2026.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle HTTP Server, Oracle Weblogic Server Proxy Plug-in",
          "versions": [
            {
              "version": "12.2.1.4.0",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "14.1.1.0.0",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "14.1.2.0.0",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle HTTP Server, Oracle Weblogic Server Proxy Plug-in.  While the vulnerability is in Oracle HTTP Server, Oracle Weblogic Server Proxy Plug-in, attacks may significantly impact additional products (scope change).  Successful attacks of this vulnerability can result in  unauthorized creation, deletion or modification access to critical data or all Oracle HTTP Server, Oracle Weblogic Server Proxy Plug-in accessible data as well as  unauthorized access to critical data or complete access to all Oracle HTTP Server, Oracle Weblogic Server Proxy Plug-in accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-68609",
      "publishedDate": "2026-01-22T19:06:05.914Z",
      "lastModifiedDate": "2026-01-22T19:33:36.287Z",
      "description": "A vulnerability in Palantir's Aries service allowed unauthenticated access to log viewing and management functionality on Apollo instances using default configuration. The defect resulted in both authentication and authorization checks being bypassed, potentially allowing any network-accessible client to view system logs and perform operations without valid credentials. No evidence of exploitation was identified during the vulnerability window.",
      "severity": 6.6,
      "references": [
        {
          "url": "https://palantir.safebase.us/?tcuUid=955a313a-1735-48a6-9fb4-e10404f14eb5",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Palantir",
          "product": "com.palantir.aries:aries",
          "versions": [
            {
              "versionType": "semver",
              "version": "1.554.0",
              "lessThan": "*",
              "status": "unaffected"
            }
          ]
        }
      ],
      "problemType": [
        "The authentication algorithm is sound, but the implemented mechanism can be bypassed as the result of a separate weakness that is primary to the authentication error."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2026-22281",
      "publishedDate": "2026-01-22T19:11:28.454Z",
      "lastModifiedDate": "2026-01-22T19:35:02.793Z",
      "description": "Dell PowerScale OneFS, versions 9.5.0.0 through 9.5.1.5, versions 9.6.0.0 through 9.7.1.10, versions 9.8.0.0 through 9.10.1.3, versions starting from 9.11.0.0 and prior to 9.13.0.0, contains a Time-of-check Time-of-use (TOCTOU) race condition vulnerability. A low privileged attacker with adjacent network access could potentially exploit this vulnerability, leading to denial of service.",
      "severity": 3.5,
      "references": [
        {
          "url": "https://www.dell.com/support/kbdoc/en-us/000415586/dsa-2026-049-security-update-for-dell-powerscale-onefs-multiple-vulnerabilities",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "defaultStatus": "unaffected",
          "product": "PowerScale OneFS",
          "vendor": "Dell",
          "versions": [
            {
              "lessThan": "9.13.0.0",
              "status": "affected",
              "version": "N/A",
              "versionType": "semver"
            },
            {
              "lessThan": "9.5.1.6",
              "status": "affected",
              "version": "N/A",
              "versionType": "semver"
            },
            {
              "lessThan": "9.7.1.11",
              "status": "affected",
              "version": "N/A",
              "versionType": "semver"
            },
            {
              "lessThan": "9.10.1.4",
              "status": "affected",
              "version": "N/A",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-367: Time-of-check Time-of-use (TOCTOU) Race Condition"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}