{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 3,
    "last_updated": "2025-12-17T19:27:43.889557",
    "severity_distribution": {
      "critical": 0,
      "high": 2,
      "medium": 0,
      "low": 0,
      "none": 1
    }
  },
  "cves": [
    {
      "id": "CVE-2025-66397",
      "publishedDate": "2025-12-17T19:12:41.501Z",
      "lastModifiedDate": "2025-12-17T19:12:41.501Z",
      "description": "ChurchCRM is an open-source church management system. Prior to version 6.5.3, the allowRegistration, acceptKiosk, reloadKiosk, and identifyKiosk functions in the Kiosk Manager feature suffers from broken access control, allowing any authenticated user to allow and accept kiosk registrations, and perform other Kiosk Manager actions such as reload and identify. Version 6.5.3 fixes the issue.",
      "severity": 8.3,
      "references": [
        {
          "url": "https://github.com/ChurchCRM/CRM/security/advisories/GHSA-32vr-ch3p-wmr5",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "ChurchCRM",
          "product": "CRM",
          "versions": [
            {
              "version": "< 6.5.3",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-284: Improper Access Control"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-66396",
      "publishedDate": "2025-12-17T19:10:49.689Z",
      "lastModifiedDate": "2025-12-17T19:10:49.689Z",
      "description": "ChurchCRM is an open-source church management system. Prior to version 6.5.3, a SQL injection vulnerability exists in the `src/UserEditor.php` file. When an administrator saves a user's configuration settings, the keys of the `type` POST parameter array are not properly sanitized or type-casted before being used in multiple SQL queries. This allows a malicious or compromised administrator account to execute arbitrary SQL commands, including time-based blind SQL injection attacks, to directly interact with the database. The vulnerability is located in `src/UserEditor.php` within the logic that handles saving user-specific configuration settings. The `type` parameter from the POST request is processed as an array. The code iterates through this array and uses `key($type)` to extract the array key, which is expected to be a numeric ID. This key is then assigned to the `$id` variable. The `$id` variable is subsequently concatenated directly into a `SELECT` and an `UPDATE` SQL query without any sanitization or validation, making it an injection vector. Although the vulnerability requires administrator privileges to exploit, it allows a malicious or compromised admin account to execute arbitrary SQL queries. This can be used to bypass any application-level logging or restrictions, directly manipulate the database, exfiltrate, modify, or delete all data (including other user credentials, financial records, and personal information), and could potentially lead to further system compromise, such as writing files to the server, depending on the database's configuration and user privileges. Version 6.5.3 patches the issue.",
      "severity": 7.2,
      "references": [
        {
          "url": "https://github.com/ChurchCRM/CRM/security/advisories/GHSA-whpp-wx64-4qp9",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "ChurchCRM",
          "product": "CRM",
          "versions": [
            {
              "version": "< 6.5.3",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-89: Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-67073",
      "publishedDate": "2025-12-17T00:00:00.000Z",
      "lastModifiedDate": "2025-12-17T19:13:55.920Z",
      "description": "A Buffer overflow vulnerability in function fromAdvSetMacMtuWan of bin httpd in Tenda AC10V4.0 V16.03.10.20 allows remote attackers to cause denial of service and possibly code execution by sending a post request with a crafted payload (field `serviceName`) to /goform/AdvSetMacMtuWan.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://github.com/johnathanhuutri/CVEReport/tree/master/CVE-2025-67073",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "n/a",
          "product": "n/a",
          "versions": [
            {
              "version": "n/a",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "n/a"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}