{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 10,
    "last_updated": "2026-01-21T15:19:59.143347",
    "severity_distribution": {
      "critical": 0,
      "high": 2,
      "medium": 5,
      "low": 1,
      "none": 2
    }
  },
  "cves": [
    {
      "id": "CVE-2026-21945",
      "publishedDate": "2026-01-20T21:56:27.997Z",
      "lastModifiedDate": "2026-01-21T15:05:36.940Z",
      "description": "Vulnerability in the Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition product of Oracle Java SE (component: Security).  Supported versions that are affected are Oracle Java SE: 8u471, 8u471-b50, 8u471-perf, 11.0.29, 17.0.17, 21.0.9, 25.0.1; Oracle GraalVM for JDK: 17.0.17 and  21.0.9; Oracle GraalVM Enterprise Edition: 21.3.16. Easily exploitable vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition. Note: This vulnerability applies to Java deployments, typically in clients running sandboxed Java Web Start applications or sandboxed Java applets, that load and run untrusted code (e.g., code that comes from the internet) and rely on the Java sandbox for security. This vulnerability does not apply to Java deployments, typically in servers, that load and run only trusted code (e.g., code installed by an administrator). CVSS 3.1 Base Score 7.5 (Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).",
      "severity": 7.5,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpujan2026.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Java SE",
          "versions": [
            {
              "version": "8u471",
              "status": "affected"
            },
            {
              "version": "8u471-b50",
              "status": "affected"
            },
            {
              "version": "8u471-perf",
              "status": "affected"
            },
            {
              "version": "11.0.29",
              "status": "affected"
            },
            {
              "version": "17.0.17",
              "status": "affected"
            },
            {
              "version": "21.0.9",
              "status": "affected"
            },
            {
              "version": "25.0.1",
              "status": "affected"
            }
          ]
        },
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle GraalVM for JDK",
          "versions": [
            {
              "version": "17.0.17",
              "status": "affected"
            },
            {
              "version": "21.0.9",
              "status": "affected"
            }
          ]
        },
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle GraalVM Enterprise Edition",
          "versions": [
            {
              "version": "21.3.16",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-68133",
      "publishedDate": "2026-01-21T02:25:03.085Z",
      "lastModifiedDate": "2026-01-21T15:09:48.152Z",
      "description": "EVerest is an EV charging software stack. In versions 2025.9.0 and below, an attacker can exhaust the operating system's memory and cause the module to terminate by initiating an unlimited number of TCP connections that never proceed to ISO 15118-2 communication. This is possible because a new thread is started for each incoming plain TCP or TLS socket connection before any verification occurs, and the verification performed is too permissive. The EVerest processes and all its modules shut down, affecting all EVSE functionality. This issue is fixed in version 2025.10.0.",
      "severity": 7.4,
      "references": [
        {
          "url": "https://github.com/EVerest/everest-core/security/advisories/GHSA-mv3w-pp85-5h7c",
          "type": "reference"
        },
        {
          "url": "https://github.com/EVerest/everest-core/commit/8127b8c54b296c4dd01b356ac26763f81f76a8fd",
          "type": "reference"
        },
        {
          "url": "https://github.com/EVerest/everest-core/commit/de504f0c11069010d26767b0952739e9a400cef3",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "EVerest",
          "product": "everest-core",
          "versions": [
            {
              "version": "< 2025.10.0",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-770: Allocation of Resources Without Limits or Throttling"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2026-21949",
      "publishedDate": "2026-01-20T21:56:29.318Z",
      "lastModifiedDate": "2026-01-21T15:15:52.637Z",
      "description": "Vulnerability in the MySQL Server product of Oracle MySQL (component: Server: Optimizer).  Supported versions that are affected are 9.0.0-9.5.0. Easily exploitable vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Server.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.1 Base Score 6.5 (Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).",
      "severity": 6.5,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpujan2026.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "MySQL Server",
          "versions": [
            {
              "version": "9.0.0",
              "status": "affected",
              "lessThanOrEqual": "9.5.0",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Server.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2026-21944",
      "publishedDate": "2026-01-20T21:56:27.694Z",
      "lastModifiedDate": "2026-01-21T15:03:45.583Z",
      "description": "Vulnerability in the Oracle Agile Product Lifecycle Management for Process product of Oracle Supply Chain (component: Product Quality Management).   The supported version that is affected is 6.2.4. Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle Agile Product Lifecycle Management for Process.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle Agile Product Lifecycle Management for Process accessible data. CVSS 3.1 Base Score 6.5 (Confidentiality impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).",
      "severity": 6.5,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpujan2026.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Agile Product Lifecycle Management for Process",
          "versions": [
            {
              "version": "6.2.4",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle Agile Product Lifecycle Management for Process.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle Agile Product Lifecycle Management for Process accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2026-21946",
      "publishedDate": "2026-01-20T21:56:28.311Z",
      "lastModifiedDate": "2026-01-21T15:07:29.834Z",
      "description": "Vulnerability in the JD Edwards EnterpriseOne Tools product of Oracle JD Edwards (component: Web Runtime SEC).  Supported versions that are affected are 9.2.0.0-9.2.26.0. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise JD Edwards EnterpriseOne Tools.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in JD Edwards EnterpriseOne Tools, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of JD Edwards EnterpriseOne Tools accessible data as well as  unauthorized read access to a subset of JD Edwards EnterpriseOne Tools accessible data. CVSS 3.1 Base Score 6.1 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).",
      "severity": 6.1,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpujan2026.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "JD Edwards EnterpriseOne Tools",
          "versions": [
            {
              "version": "9.2.0.0",
              "status": "affected",
              "lessThanOrEqual": "9.2.26.0",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise JD Edwards EnterpriseOne Tools.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in JD Edwards EnterpriseOne Tools, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of JD Edwards EnterpriseOne Tools accessible data as well as  unauthorized read access to a subset of JD Edwards EnterpriseOne Tools accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2026-21943",
      "publishedDate": "2026-01-20T21:56:27.362Z",
      "lastModifiedDate": "2026-01-21T15:02:26.204Z",
      "description": "Vulnerability in the Oracle Scripting product of Oracle E-Business Suite (component: Scripting Admin).  Supported versions that are affected are 12.2.3-12.2.15. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Scripting.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Scripting, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Scripting accessible data as well as  unauthorized read access to a subset of Oracle Scripting accessible data. CVSS 3.1 Base Score 6.1 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).",
      "severity": 6.1,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpujan2026.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Scripting",
          "versions": [
            {
              "version": "12.2.3",
              "status": "affected",
              "lessThanOrEqual": "12.2.15",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Scripting.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Scripting, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Scripting accessible data as well as  unauthorized read access to a subset of Oracle Scripting accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2026-21948",
      "publishedDate": "2026-01-20T21:56:29.010Z",
      "lastModifiedDate": "2026-01-21T15:12:07.779Z",
      "description": "Vulnerability in the MySQL Server product of Oracle MySQL (component: Server: Optimizer).  Supported versions that are affected are 8.0.0-8.0.44, 8.4.0-8.4.7 and  9.0.0-9.5.0. Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.1 Base Score 4.9 (Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).",
      "severity": 4.9,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpujan2026.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "MySQL Server",
          "versions": [
            {
              "version": "8.0.0",
              "status": "affected",
              "lessThanOrEqual": "8.0.44",
              "versionType": "custom"
            },
            {
              "version": "8.4.0",
              "status": "affected",
              "lessThanOrEqual": "8.4.7",
              "versionType": "custom"
            },
            {
              "version": "9.0.0",
              "status": "affected",
              "lessThanOrEqual": "9.5.0",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2026-21947",
      "publishedDate": "2026-01-20T21:56:28.663Z",
      "lastModifiedDate": "2026-01-21T15:09:50.772Z",
      "description": "Vulnerability in Oracle Java SE (component: JavaFX).  Supported versions that are affected are Oracle Java SE: 8u471-b50. Difficult to exploit vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Oracle Java SE.  Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Java SE accessible data. Note: This vulnerability applies to Java deployments, typically in clients running sandboxed Java Web Start applications or sandboxed Java applets, that load and run untrusted code (e.g., code that comes from the internet) and rely on the Java sandbox for security. This vulnerability does not apply to Java deployments, typically in servers, that load and run only trusted code (e.g., code installed by an administrator). CVSS 3.1 Base Score 3.1 (Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:H/PR:N/UI:R/S:U/C:N/I:L/A:N).",
      "severity": 3.1,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpujan2026.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Java SE",
          "versions": [
            {
              "version": "8u471-b50",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "Difficult to exploit vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Oracle Java SE.  Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Java SE accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-70651",
      "publishedDate": "2026-01-21T00:00:00.000Z",
      "lastModifiedDate": "2026-01-21T15:07:48.618Z",
      "description": "Tenda AX-1803 v1.0.0.1 was discovered to contain a stack overflow in the ssid parameter of the form_fast_setting_wifi_set function. This vulnerability allows attackers to cause a Denial of Service (DoS) via a crafted request.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://github.com/0-fool/VulnbyCola/blob/main/Tenda/AX-1803/4/1.md",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "n/a",
          "product": "n/a",
          "versions": [
            {
              "version": "n/a",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "n/a"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-70650",
      "publishedDate": "2026-01-21T00:00:00.000Z",
      "lastModifiedDate": "2026-01-21T15:06:06.504Z",
      "description": "Tenda AX-1806 v1.0.0.1 was discovered to contain a stack overflow in the deviceList parameter of the formSetMacFilterCfg function. This vulnerability allows attackers to cause a Denial of Service (DoS) via a crafted request.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://github.com/0-fool/VulnbyCola/blob/main/Tenda/AX-1806/1/1.md",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "n/a",
          "product": "n/a",
          "versions": [
            {
              "version": "n/a",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "n/a"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}