{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 35,
    "last_updated": "2025-04-15T20:40:54.005055",
    "severity_distribution": {
      "critical": 1,
      "high": 7,
      "medium": 22,
      "low": 2,
      "none": 3
    }
  },
  "cves": [
    {
      "id": "CVE-2025-30727",
      "publishedDate": "2025-04-15T20:31:16.930Z",
      "lastModifiedDate": "2025-04-15T20:31:16.930Z",
      "description": "Vulnerability in the Oracle Scripting product of Oracle E-Business Suite (component: iSurvey Module).  Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Scripting.  Successful attacks of this vulnerability can result in takeover of Oracle Scripting. CVSS 3.1 Base Score 9.8 (Confidentiality, Integrity and Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).",
      "severity": 9.8,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Scripting",
          "versions": [
            {
              "version": "12.2.3",
              "status": "affected",
              "lessThanOrEqual": "12.2.14",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Scripting.  Successful attacks of this vulnerability can result in takeover of Oracle Scripting."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30735",
      "publishedDate": "2025-04-15T20:31:19.752Z",
      "lastModifiedDate": "2025-04-15T20:31:19.752Z",
      "description": "Vulnerability in the PeopleSoft Enterprise CC Common Application Objects product of Oracle PeopleSoft (component: Page and Field Configuration).   The supported version that is affected is 9.2. Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise PeopleSoft Enterprise CC Common Application Objects.  Successful attacks of this vulnerability can result in  unauthorized creation, deletion or modification access to critical data or all PeopleSoft Enterprise CC Common Application Objects accessible data as well as  unauthorized access to critical data or complete access to all PeopleSoft Enterprise CC Common Application Objects accessible data. CVSS 3.1 Base Score 8.1 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:N).",
      "severity": 8.1,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "PeopleSoft Enterprise CC Common Application Objects",
          "versions": [
            {
              "version": "9.2",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise PeopleSoft Enterprise CC Common Application Objects.  Successful attacks of this vulnerability can result in  unauthorized creation, deletion or modification access to critical data or all PeopleSoft Enterprise CC Common Application Objects accessible data as well as  unauthorized access to critical data or complete access to all PeopleSoft Enterprise CC Common Application Objects accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30712",
      "publishedDate": "2025-04-15T20:31:10.623Z",
      "lastModifiedDate": "2025-04-15T20:31:10.623Z",
      "description": "Vulnerability in the Oracle VM VirtualBox product of Oracle Virtualization (component: Core).   The supported version that is affected is 7.1.6. Easily exploitable vulnerability allows high privileged attacker with logon to the infrastructure where Oracle VM VirtualBox executes to compromise Oracle VM VirtualBox.  While the vulnerability is in Oracle VM VirtualBox, attacks may significantly impact additional products (scope change).  Successful attacks of this vulnerability can result in  unauthorized creation, deletion or modification access to critical data or all Oracle VM VirtualBox accessible data as well as  unauthorized access to critical data or complete access to all Oracle VM VirtualBox accessible data and unauthorized ability to cause a partial denial of service (partial DOS) of Oracle VM VirtualBox. CVSS 3.1 Base Score 8.1 (Confidentiality, Integrity and Availability impacts).  CVSS Vector: (CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:C/C:H/I:H/A:L).",
      "severity": 8.1,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle VM VirtualBox",
          "versions": [
            {
              "version": "7.1.6",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows high privileged attacker with logon to the infrastructure where Oracle VM VirtualBox executes to compromise Oracle VM VirtualBox.  While the vulnerability is in Oracle VM VirtualBox, attacks may significantly impact additional products (scope change).  Successful attacks of this vulnerability can result in  unauthorized creation, deletion or modification access to critical data or all Oracle VM VirtualBox accessible data as well as  unauthorized access to critical data or complete access to all Oracle VM VirtualBox accessible data and unauthorized ability to cause a partial denial of service (partial DOS) of Oracle VM VirtualBox."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30730",
      "publishedDate": "2025-04-15T20:31:18.149Z",
      "lastModifiedDate": "2025-04-15T20:31:18.149Z",
      "description": "Vulnerability in the Oracle Application Object Library product of Oracle E-Business Suite (component: Core).  Supported versions that are affected are 12.2.5-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Application Object Library.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of Oracle Application Object Library. CVSS 3.1 Base Score 7.5 (Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).",
      "severity": 7.5,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Application Object Library",
          "versions": [
            {
              "version": "12.2.5",
              "status": "affected",
              "lessThanOrEqual": "12.2.14",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Application Object Library.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of Oracle Application Object Library."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30728",
      "publishedDate": "2025-04-15T20:31:17.279Z",
      "lastModifiedDate": "2025-04-15T20:31:17.279Z",
      "description": "Vulnerability in the Oracle Configurator product of Oracle E-Business Suite (component: Core).  Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Configurator.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle Configurator accessible data. CVSS 3.1 Base Score 7.5 (Confidentiality impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).",
      "severity": 7.5,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Configurator",
          "versions": [
            {
              "version": "12.2.3",
              "status": "affected",
              "lessThanOrEqual": "12.2.14",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Configurator.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle Configurator accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30724",
      "publishedDate": "2025-04-15T20:31:15.772Z",
      "lastModifiedDate": "2025-04-15T20:31:15.772Z",
      "description": "Vulnerability in the Oracle BI Publisher product of Oracle Analytics (component: XML Services).  Supported versions that are affected are 7.6.0.0.0 and  12.2.1.4.0. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle BI Publisher.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle BI Publisher accessible data. CVSS 3.1 Base Score 7.5 (Confidentiality impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).",
      "severity": 7.5,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle BI Publisher",
          "versions": [
            {
              "version": "7.6.0.0.0",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "12.2.1.4.0",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle BI Publisher.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle BI Publisher accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30716",
      "publishedDate": "2025-04-15T20:31:12.406Z",
      "lastModifiedDate": "2025-04-15T20:31:12.406Z",
      "description": "Vulnerability in the Oracle Common Applications product of Oracle E-Business Suite (component: CRM User Management Framework).  Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Common Applications.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle Common Applications accessible data. CVSS 3.1 Base Score 7.5 (Confidentiality impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).",
      "severity": 7.5,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Common Applications",
          "versions": [
            {
              "version": "12.2.3",
              "status": "affected",
              "lessThanOrEqual": "12.2.14",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Common Applications.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle Common Applications accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30736",
      "publishedDate": "2025-04-15T20:31:20.114Z",
      "lastModifiedDate": "2025-04-15T20:31:20.114Z",
      "description": "Vulnerability in the Java VM component of Oracle Database Server.  Supported versions that are affected are 19.3-19.26, 21.3-21.17 and  23.4-23.7. Difficult to exploit vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Java VM.  Successful attacks of this vulnerability can result in  unauthorized creation, deletion or modification access to critical data or all Java VM accessible data as well as  unauthorized access to critical data or complete access to all Java VM accessible data. CVSS 3.1 Base Score 7.4 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).",
      "severity": 7.4,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Database Server",
          "versions": [
            {
              "version": "19.3",
              "status": "affected",
              "lessThanOrEqual": "19.26",
              "versionType": "semver"
            },
            {
              "version": "21.3",
              "status": "affected",
              "lessThanOrEqual": "21.17",
              "versionType": "semver"
            },
            {
              "version": "23.4",
              "status": "affected",
              "lessThanOrEqual": "23.7",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Difficult to exploit vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Java VM.  Successful attacks of this vulnerability can result in  unauthorized creation, deletion or modification access to critical data or all Java VM accessible data as well as  unauthorized access to critical data or complete access to all Java VM accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30725",
      "publishedDate": "2025-04-15T20:31:16.140Z",
      "lastModifiedDate": "2025-04-15T20:31:16.140Z",
      "description": "Vulnerability in the Oracle VM VirtualBox product of Oracle Virtualization (component: Core).   The supported version that is affected is 7.1.6. Difficult to exploit vulnerability allows high privileged attacker with logon to the infrastructure where Oracle VM VirtualBox executes to compromise Oracle VM VirtualBox.  While the vulnerability is in Oracle VM VirtualBox, attacks may significantly impact additional products (scope change).  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of Oracle VM VirtualBox as well as  unauthorized update, insert or delete access to some of Oracle VM VirtualBox accessible data and  unauthorized read access to a subset of Oracle VM VirtualBox accessible data. CVSS 3.1 Base Score 6.7 (Confidentiality, Integrity and Availability impacts).  CVSS Vector: (CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:C/C:L/I:L/A:H).",
      "severity": 6.7,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle VM VirtualBox",
          "versions": [
            {
              "version": "7.1.6",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Difficult to exploit vulnerability allows high privileged attacker with logon to the infrastructure where Oracle VM VirtualBox executes to compromise Oracle VM VirtualBox.  While the vulnerability is in Oracle VM VirtualBox, attacks may significantly impact additional products (scope change).  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of Oracle VM VirtualBox as well as  unauthorized update, insert or delete access to some of Oracle VM VirtualBox accessible data and  unauthorized read access to a subset of Oracle VM VirtualBox accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30740",
      "publishedDate": "2025-04-15T20:31:20.966Z",
      "lastModifiedDate": "2025-04-15T20:31:20.966Z",
      "description": "Vulnerability in the JD Edwards EnterpriseOne Tools product of Oracle JD Edwards (component: Web Runtime SEC).  Supported versions that are affected are 9.2.0.0-9.2.9.2. Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise JD Edwards EnterpriseOne Tools.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all JD Edwards EnterpriseOne Tools accessible data. CVSS 3.1 Base Score 6.5 (Confidentiality impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).",
      "severity": 6.5,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "JD Edwards EnterpriseOne Tools",
          "versions": [
            {
              "version": "9.2.0.0",
              "status": "affected",
              "lessThanOrEqual": "9.2.9.2",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise JD Edwards EnterpriseOne Tools.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all JD Edwards EnterpriseOne Tools accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30733",
      "publishedDate": "2025-04-15T20:31:19.398Z",
      "lastModifiedDate": "2025-04-15T20:31:19.398Z",
      "description": "Vulnerability in the RDBMS Listener component of Oracle Database Server.  Supported versions that are affected are 19.3-19.26, 21.3-21.17 and  23.4-23.7. Easily exploitable vulnerability allows unauthenticated attacker with network access via Oracle Net to compromise RDBMS Listener.  Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all RDBMS Listener accessible data. CVSS 3.1 Base Score 6.5 (Confidentiality impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).",
      "severity": 6.5,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Database Server",
          "versions": [
            {
              "version": "19.3",
              "status": "affected",
              "lessThanOrEqual": "19.26",
              "versionType": "semver"
            },
            {
              "version": "21.3",
              "status": "affected",
              "lessThanOrEqual": "21.17",
              "versionType": "semver"
            },
            {
              "version": "23.4",
              "status": "affected",
              "lessThanOrEqual": "23.7",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via Oracle Net to compromise RDBMS Listener.  Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all RDBMS Listener accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30717",
      "publishedDate": "2025-04-15T20:31:12.865Z",
      "lastModifiedDate": "2025-04-15T20:31:12.865Z",
      "description": "Vulnerability in the Oracle Teleservice product of Oracle E-Business Suite (component: Service Diagnostics Scripts).  Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle Teleservice.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle Teleservice accessible data. CVSS 3.1 Base Score 6.5 (Confidentiality impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).",
      "severity": 6.5,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Teleservice",
          "versions": [
            {
              "version": "12.2.3",
              "status": "affected",
              "lessThanOrEqual": "12.2.14",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle Teleservice.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle Teleservice accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30732",
      "publishedDate": "2025-04-15T20:31:19.003Z",
      "lastModifiedDate": "2025-04-15T20:31:19.003Z",
      "description": "Vulnerability in the Oracle Application Object Library product of Oracle E-Business Suite (component: Core).  Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Application Object Library.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Application Object Library, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Application Object Library accessible data as well as  unauthorized read access to a subset of Oracle Application Object Library accessible data. CVSS 3.1 Base Score 6.1 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).",
      "severity": 6.1,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Application Object Library",
          "versions": [
            {
              "version": "12.2.3",
              "status": "affected",
              "lessThanOrEqual": "12.2.14",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Application Object Library.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Application Object Library, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Application Object Library accessible data as well as  unauthorized read access to a subset of Oracle Application Object Library accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30720",
      "publishedDate": "2025-04-15T20:31:14.152Z",
      "lastModifiedDate": "2025-04-15T20:31:14.152Z",
      "description": "Vulnerability in the Oracle Configurator product of Oracle E-Business Suite (component: Orders).  Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Configurator.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Configurator, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Configurator accessible data as well as  unauthorized read access to a subset of Oracle Configurator accessible data. CVSS 3.1 Base Score 6.1 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).",
      "severity": 6.1,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Configurator",
          "versions": [
            {
              "version": "12.2.3",
              "status": "affected",
              "lessThanOrEqual": "12.2.14",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Configurator.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Configurator, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Configurator accessible data as well as  unauthorized read access to a subset of Oracle Configurator accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30719",
      "publishedDate": "2025-04-15T20:31:13.777Z",
      "lastModifiedDate": "2025-04-15T20:31:13.777Z",
      "description": "Vulnerability in the Oracle VM VirtualBox product of Oracle Virtualization (component: Core).   The supported version that is affected is 7.1.6. Easily exploitable vulnerability allows low privileged attacker with logon to the infrastructure where Oracle VM VirtualBox executes to compromise Oracle VM VirtualBox.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of Oracle VM VirtualBox and  unauthorized read access to a subset of Oracle VM VirtualBox accessible data. CVSS 3.1 Base Score 6.1 (Confidentiality and Availability impacts).  CVSS Vector: (CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:H).",
      "severity": 6.1,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle VM VirtualBox",
          "versions": [
            {
              "version": "7.1.6",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows low privileged attacker with logon to the infrastructure where Oracle VM VirtualBox executes to compromise Oracle VM VirtualBox.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of Oracle VM VirtualBox and  unauthorized read access to a subset of Oracle VM VirtualBox accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30709",
      "publishedDate": "2025-04-15T20:31:09.495Z",
      "lastModifiedDate": "2025-04-15T20:31:09.495Z",
      "description": "Vulnerability in the JD Edwards EnterpriseOne Tools product of Oracle JD Edwards (component: Web Runtime SEC).  Supported versions that are affected are 9.2.0.0-9.2.9.2. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise JD Edwards EnterpriseOne Tools.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in JD Edwards EnterpriseOne Tools, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of JD Edwards EnterpriseOne Tools accessible data as well as  unauthorized read access to a subset of JD Edwards EnterpriseOne Tools accessible data. CVSS 3.1 Base Score 6.1 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).",
      "severity": 6.1,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "JD Edwards EnterpriseOne Tools",
          "versions": [
            {
              "version": "9.2.0.0",
              "status": "affected",
              "lessThanOrEqual": "9.2.9.2",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise JD Edwards EnterpriseOne Tools.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in JD Edwards EnterpriseOne Tools, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of JD Edwards EnterpriseOne Tools accessible data as well as  unauthorized read access to a subset of JD Edwards EnterpriseOne Tools accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30737",
      "publishedDate": "2025-04-15T20:31:20.542Z",
      "lastModifiedDate": "2025-04-15T20:31:20.542Z",
      "description": "Vulnerability in the Oracle Smart View for Office product of Oracle Hyperion (component: Core Smart View).   The supported version that is affected is 24.200. Difficult to exploit vulnerability allows high privileged attacker with network access via HTTP to compromise Oracle Smart View for Office.  Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in  unauthorized creation, deletion or modification access to critical data or all Oracle Smart View for Office accessible data as well as  unauthorized access to critical data or complete access to all Oracle Smart View for Office accessible data. CVSS 3.1 Base Score 5.7 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:H/PR:H/UI:R/S:U/C:H/I:H/A:N).",
      "severity": 5.7,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Smart View for Office",
          "versions": [
            {
              "version": "24.200",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Difficult to exploit vulnerability allows high privileged attacker with network access via HTTP to compromise Oracle Smart View for Office.  Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in  unauthorized creation, deletion or modification access to critical data or all Oracle Smart View for Office accessible data as well as  unauthorized access to critical data or complete access to all Oracle Smart View for Office accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30729",
      "publishedDate": "2025-04-15T20:31:17.675Z",
      "lastModifiedDate": "2025-04-15T20:31:17.675Z",
      "description": "Vulnerability in the Oracle Communications Order and Service Management product of Oracle Communications Applications (component: Security).  Supported versions that are affected are 7.4.0, 7.4.1 and  7.5.0. Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle Communications Order and Service Management.  Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Communications Order and Service Management accessible data as well as  unauthorized read access to a subset of Oracle Communications Order and Service Management accessible data and unauthorized ability to cause a partial denial of service (partial DOS) of Oracle Communications Order and Service Management. CVSS 3.1 Base Score 5.5 (Confidentiality, Integrity and Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:U/C:L/I:L/A:L).",
      "severity": 5.5,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Communications Order and Service Management",
          "versions": [
            {
              "version": "7.4.0",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "7.4.1",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "7.5.0",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle Communications Order and Service Management.  Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Communications Order and Service Management accessible data as well as  unauthorized read access to a subset of Oracle Communications Order and Service Management accessible data and unauthorized ability to cause a partial denial of service (partial DOS) of Oracle Communications Order and Service Management."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30723",
      "publishedDate": "2025-04-15T20:31:15.420Z",
      "lastModifiedDate": "2025-04-15T20:31:15.420Z",
      "description": "Vulnerability in the Oracle BI Publisher product of Oracle Analytics (component: XML Services).  Supported versions that are affected are 7.6.0.0.0 and  12.2.1.4.0. Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle BI Publisher.  Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle BI Publisher accessible data and unauthorized ability to cause a partial denial of service (partial DOS) of Oracle BI Publisher. CVSS 3.1 Base Score 5.4 (Integrity and Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:L/A:L).",
      "severity": 5.4,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle BI Publisher",
          "versions": [
            {
              "version": "7.6.0.0.0",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "12.2.1.4.0",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle BI Publisher.  Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle BI Publisher accessible data and unauthorized ability to cause a partial denial of service (partial DOS) of Oracle BI Publisher."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30718",
      "publishedDate": "2025-04-15T20:31:13.402Z",
      "lastModifiedDate": "2025-04-15T20:31:13.402Z",
      "description": "Vulnerability in the Oracle Applications Framework product of Oracle E-Business Suite (component: Attachments, File Upload).  Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle Applications Framework.  Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Applications Framework accessible data as well as  unauthorized read access to a subset of Oracle Applications Framework accessible data. CVSS 3.1 Base Score 5.4 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:N).",
      "severity": 5.4,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Applications Framework",
          "versions": [
            {
              "version": "12.2.3",
              "status": "affected",
              "lessThanOrEqual": "12.2.14",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle Applications Framework.  Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Applications Framework accessible data as well as  unauthorized read access to a subset of Oracle Applications Framework accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30713",
      "publishedDate": "2025-04-15T20:31:11.030Z",
      "lastModifiedDate": "2025-04-15T20:31:11.030Z",
      "description": "Vulnerability in the PeopleSoft Enterprise HCM Talent Acquisition Manager product of Oracle PeopleSoft (component: Job Opening).   The supported version that is affected is 9.2. Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise PeopleSoft Enterprise HCM Talent Acquisition Manager.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in PeopleSoft Enterprise HCM Talent Acquisition Manager, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of PeopleSoft Enterprise HCM Talent Acquisition Manager accessible data as well as  unauthorized read access to a subset of PeopleSoft Enterprise HCM Talent Acquisition Manager accessible data. CVSS 3.1 Base Score 5.4 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:L/A:N).",
      "severity": 5.4,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "PeopleSoft Enterprise HCM Talent Acquisition Manager",
          "versions": [
            {
              "version": "9.2",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise PeopleSoft Enterprise HCM Talent Acquisition Manager.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in PeopleSoft Enterprise HCM Talent Acquisition Manager, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of PeopleSoft Enterprise HCM Talent Acquisition Manager accessible data as well as  unauthorized read access to a subset of PeopleSoft Enterprise HCM Talent Acquisition Manager accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30711",
      "publishedDate": "2025-04-15T20:31:10.255Z",
      "lastModifiedDate": "2025-04-15T20:31:10.255Z",
      "description": "Vulnerability in the Oracle Applications Framework product of Oracle E-Business Suite (component: Attachments, File Upload).  Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle Applications Framework.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Applications Framework, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Applications Framework accessible data as well as  unauthorized read access to a subset of Oracle Applications Framework accessible data. CVSS 3.1 Base Score 5.4 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:L/A:N).",
      "severity": 5.4,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Applications Framework",
          "versions": [
            {
              "version": "12.2.3",
              "status": "affected",
              "lessThanOrEqual": "12.2.14",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle Applications Framework.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Applications Framework, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Applications Framework accessible data as well as  unauthorized read access to a subset of Oracle Applications Framework accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-24487",
      "publishedDate": "2025-04-15T20:31:50.896Z",
      "lastModifiedDate": "2025-04-15T20:31:50.896Z",
      "description": "An unauthenticated attacker can infer the existence of usernames in the system by querying an API.",
      "severity": 5.3,
      "references": [
        {
          "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-105-04",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "defaultStatus": "unaffected",
          "product": "Cloud portal",
          "vendor": "Growatt",
          "versions": [
            {
              "lessThan": "3.6.0",
              "status": "affected",
              "version": "0",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-639 Authorization Bypass Through User-Controlled Key"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30726",
      "publishedDate": "2025-04-15T20:31:16.551Z",
      "lastModifiedDate": "2025-04-15T20:31:16.551Z",
      "description": "Vulnerability in the Oracle Application Object Library product of Oracle E-Business Suite (component: Core).  Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Application Object Library.  Successful attacks of this vulnerability can result in  unauthorized read access to a subset of Oracle Application Object Library accessible data. CVSS 3.1 Base Score 5.3 (Confidentiality impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).",
      "severity": 5.3,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Application Object Library",
          "versions": [
            {
              "version": "12.2.3",
              "status": "affected",
              "lessThanOrEqual": "12.2.14",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Application Object Library.  Successful attacks of this vulnerability can result in  unauthorized read access to a subset of Oracle Application Object Library accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30722",
      "publishedDate": "2025-04-15T20:31:15.014Z",
      "lastModifiedDate": "2025-04-15T20:31:15.014Z",
      "description": "Vulnerability in the MySQL Client product of Oracle MySQL (component: Client: mysqldump).  Supported versions that are affected are 8.0.0-8.0.41, 8.4.0-8.4.4 and  9.0.0-9.2.0. Difficult to exploit vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Client.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all MySQL Client accessible data as well as  unauthorized update, insert or delete access to some of MySQL Client accessible data. CVSS 3.1 Base Score 5.9 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:L/A:N).",
      "severity": 5.3,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "MySQL Cluster",
          "versions": [
            {
              "version": "7.6.0",
              "status": "affected",
              "lessThanOrEqual": "7.6.33",
              "versionType": "semver"
            },
            {
              "version": "8.0.0",
              "status": "affected",
              "lessThanOrEqual": "8.0.41",
              "versionType": "semver"
            },
            {
              "version": "8.4.0",
              "status": "affected",
              "lessThanOrEqual": "8.4.4",
              "versionType": "semver"
            },
            {
              "version": "9.0.0",
              "status": "affected",
              "lessThanOrEqual": "9.2.0",
              "versionType": "semver"
            }
          ]
        },
        {
          "vendor": "Oracle Corporation",
          "product": "MySQL Client",
          "versions": [
            {
              "version": "8.0.0",
              "status": "affected",
              "lessThanOrEqual": "8.0.41",
              "versionType": "semver"
            },
            {
              "version": "8.4.0",
              "status": "affected",
              "lessThanOrEqual": "8.4.4",
              "versionType": "semver"
            },
            {
              "version": "9.0.0",
              "status": "affected",
              "lessThanOrEqual": "9.2.0",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Difficult to exploit vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Cluster.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all MySQL Cluster accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-31949",
      "publishedDate": "2025-04-15T20:19:24.914Z",
      "lastModifiedDate": "2025-04-15T20:34:48.685Z",
      "description": "An authenticated attacker can obtain any plant name by knowing the plant ID.",
      "severity": 5.3,
      "references": [
        {
          "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-105-04",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "defaultStatus": "unaffected",
          "product": "Cloud portal",
          "vendor": "Growatt",
          "versions": [
            {
              "lessThanOrEqual": "3.6.0",
              "status": "affected",
              "version": "0",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-639 Authorization Bypass Through User-Controlled Key"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30715",
      "publishedDate": "2025-04-15T20:31:11.982Z",
      "lastModifiedDate": "2025-04-15T20:31:11.982Z",
      "description": "Vulnerability in the MySQL Server product of Oracle MySQL (component: Server: Components Services).  Supported versions that are affected are 8.0.0-8.0.41, 8.4.0-8.4.4 and  9.0.0-9.2.0. Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.1 Base Score 4.9 (Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).",
      "severity": 4.9,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "MySQL Server",
          "versions": [
            {
              "version": "8.0.0",
              "status": "affected",
              "lessThanOrEqual": "8.0.41",
              "versionType": "semver"
            },
            {
              "version": "8.4.0",
              "status": "affected",
              "lessThanOrEqual": "8.4.4",
              "versionType": "semver"
            },
            {
              "version": "9.0.0",
              "status": "affected",
              "lessThanOrEqual": "9.2.0",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30710",
      "publishedDate": "2025-04-15T20:31:09.911Z",
      "lastModifiedDate": "2025-04-15T20:31:09.911Z",
      "description": "Vulnerability in the MySQL Cluster product of Oracle MySQL (component: Cluster: NDBCluster Plugin).  Supported versions that are affected are 8.0.0-8.0.41, 8.4.0-8.4.4 and  9.0.0-9.2.0. Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Cluster.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Cluster. CVSS 3.1 Base Score 4.9 (Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).",
      "severity": 4.9,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "MySQL Cluster",
          "versions": [
            {
              "version": "8.0.0",
              "status": "affected",
              "lessThanOrEqual": "8.0.41",
              "versionType": "semver"
            },
            {
              "version": "8.4.0",
              "status": "affected",
              "lessThanOrEqual": "8.4.4",
              "versionType": "semver"
            },
            {
              "version": "9.0.0",
              "status": "affected",
              "lessThanOrEqual": "9.2.0",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Cluster.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Cluster."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30714",
      "publishedDate": "2025-04-15T20:31:11.528Z",
      "lastModifiedDate": "2025-04-15T20:31:11.528Z",
      "description": "Vulnerability in the MySQL Connectors product of Oracle MySQL (component: Connector/Python).  Supported versions that are affected are 9.0.0-9.2.0. Difficult to exploit vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Connectors.  Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all MySQL Connectors accessible data. CVSS 3.1 Base Score 4.8 (Confidentiality impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:H/PR:L/UI:R/S:U/C:H/I:N/A:N).",
      "severity": 4.8,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "MySQL Connectors",
          "versions": [
            {
              "version": "9.0.0",
              "status": "affected",
              "lessThanOrEqual": "9.2.0",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Difficult to exploit vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Connectors.  Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all MySQL Connectors accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30721",
      "publishedDate": "2025-04-15T20:31:14.589Z",
      "lastModifiedDate": "2025-04-15T20:31:14.589Z",
      "description": "Vulnerability in the MySQL Server product of Oracle MySQL (component: Server: UDF).  Supported versions that are affected are 8.0.0-8.0.41, 8.4.0-8.4.4 and  9.0.0-9.2.0. Difficult to exploit vulnerability allows high privileged attacker with logon to the infrastructure where MySQL Server executes to compromise MySQL Server.  Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.1 Base Score 4.0 (Availability impacts).  CVSS Vector: (CVSS:3.1/AV:L/AC:H/PR:H/UI:R/S:U/C:N/I:N/A:H).",
      "severity": 4,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "MySQL Server",
          "versions": [
            {
              "version": "8.0.0",
              "status": "affected",
              "lessThanOrEqual": "8.0.41",
              "versionType": "semver"
            },
            {
              "version": "8.4.0",
              "status": "affected",
              "lessThanOrEqual": "8.4.4",
              "versionType": "semver"
            },
            {
              "version": "9.0.0",
              "status": "affected",
              "lessThanOrEqual": "9.2.0",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Difficult to exploit vulnerability allows high privileged attacker with logon to the infrastructure where MySQL Server executes to compromise MySQL Server.  Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-30731",
      "publishedDate": "2025-04-15T20:31:18.582Z",
      "lastModifiedDate": "2025-04-15T20:31:18.582Z",
      "description": "Vulnerability in the Oracle Applications Technology Stack product of Oracle E-Business Suite (component: Configuration).  Supported versions that are affected are 12.2.3-12.2.14. Difficult to exploit vulnerability allows unauthenticated attacker with logon to the infrastructure where Oracle Applications Technology Stack executes to compromise Oracle Applications Technology Stack.  Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Applications Technology Stack accessible data as well as  unauthorized read access to a subset of Oracle Applications Technology Stack accessible data. CVSS 3.1 Base Score 3.6 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:L/AC:H/PR:N/UI:R/S:U/C:L/I:L/A:N).",
      "severity": 3.6,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuapr2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Applications Technology Stack",
          "versions": [
            {
              "version": "12.2.3",
              "status": "affected",
              "lessThanOrEqual": "12.2.14",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Difficult to exploit vulnerability allows unauthenticated attacker with logon to the infrastructure where Oracle Applications Technology Stack executes to compromise Oracle Applications Technology Stack.  Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Applications Technology Stack accessible data as well as  unauthorized read access to a subset of Oracle Applications Technology Stack accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-32021",
      "publishedDate": "2025-04-15T20:39:09.253Z",
      "lastModifiedDate": "2025-04-15T20:39:09.253Z",
      "description": "Weblate is a web based localization tool. Prior to version 5.11, when creating a new component from an existing component that has a source code repository URL specified in settings, this URL is included in the client's URL parameters during the creation process. If, for example, the source code repository URL contains GitHub credentials, the confidential PAT and username are shown in plaintext and get saved into browser history. Moreover, if the request URL is logged, the credentials are written to logs in plaintext. If using Weblate official Docker image, nginx logs the URL and the token in plaintext. This issue is patched in version 5.11.",
      "severity": 2.2,
      "references": [
        {
          "url": "https://github.com/WeblateOrg/weblate/security/advisories/GHSA-m67m-3p5g-cw9j",
          "type": "reference"
        },
        {
          "url": "https://github.com/WeblateOrg/weblate/releases/tag/weblate-5.11",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "WeblateOrg",
          "product": "weblate",
          "versions": [
            {
              "version": "< 5.11",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-598: Use of GET Request Method With Sensitive Query Strings"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-31499",
      "publishedDate": "2025-04-15T20:36:24.078Z",
      "lastModifiedDate": "2025-04-15T20:36:24.078Z",
      "description": "Jellyfin is an open source self hosted media server. Versions before 10.10.7 are vulnerable to argument injection in FFmpeg. This can be leveraged to possibly achieve remote code execution by anyone with credentials to a low-privileged user. This vulnerability was previously reported in CVE-2023-49096 and patched in version 10.8.13, but the patch can be bypassed. The original fix sanitizes some parameters to make injection impossible, but certain unsanitized parameters can still be used for argument injection. The same unauthenticated endpoints are vulnerable: /Videos/<itemId>/stream and /Videos/<itemId>/stream.<container>, likely alongside similar endpoints in AudioController. This argument injection can be exploited to achieve arbitrary file write, leading to possible remote code execution through the plugin system. While the unauthenticated endpoints are vulnerable, a valid itemId is required for exploitation and any authenticated attacker could easily retrieve a valid itemId to make the exploit work. This vulnerability is patched in version 10.10.7.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://github.com/jellyfin/jellyfin/security/advisories/GHSA-2c3c-r7gp-q32m",
          "type": "reference"
        },
        {
          "url": "https://github.com/jellyfin/jellyfin/commit/79f3ce53257c5291887cd52d8ac735b5252c9a97",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "jellyfin",
          "product": "jellyfin",
          "versions": [
            {
              "version": "< 10.10.7",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-88: Improper Neutralization of Argument Delimiters in a Command ('Argument Injection')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-32778",
      "publishedDate": "2025-04-15T20:19:58.458Z",
      "lastModifiedDate": "2025-04-15T20:31:34.236Z",
      "description": "Web-Check is an all-in-one OSINT tool for analyzing any website. A command injection vulnerability exists in the screenshot API of the Web Check project (Lissy93/web-check). The issue stems from user-controlled input (url) being passed unsanitized into a shell command using exec(), allowing attackers to execute arbitrary system commands on the underlying host. This could be exploited by sending crafted url parameters to extract files or even establish remote access. The vulnerability has been patched by replacing exec() with execFile(), which avoids using a shell and properly isolates arguments.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://github.com/Lissy93/web-check/security/advisories/GHSA-5qg5-g7c2-pfx8",
          "type": "reference"
        },
        {
          "url": "https://github.com/Lissy93/web-check/pull/243",
          "type": "reference"
        },
        {
          "url": "https://github.com/Lissy93/web-check/commit/0e4958aa10b2650d32439a799f6fc83a7cd46cef",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Lissy93",
          "product": "web-check",
          "versions": [
            {
              "version": "< 2.0.1",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-78: Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-25456",
      "publishedDate": "2025-04-15T00:00:00.000Z",
      "lastModifiedDate": "2025-04-15T20:34:29.442Z",
      "description": "Tenda AC10 V4.0si_V16.03.10.20 is vulnerable to Buffer Overflow in AdvSetMacMtuWan via mac2.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://github.com/xyqer1/Tenda-AC10-AdvSetMacMtuWan-mac2-StackOverflow",
          "type": "reference"
        },
        {
          "url": "https://gist.github.com/xyqer1/ab1e6a2bd369aaada0666639c843aff0",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "n/a",
          "product": "n/a",
          "versions": [
            {
              "version": "n/a",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "n/a"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}