{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 2,
    "last_updated": "2025-06-30T13:38:05.698886",
    "severity_distribution": {
      "critical": 0,
      "high": 1,
      "medium": 1,
      "low": 0,
      "none": 0
    }
  },
  "cves": [
    {
      "id": "CVE-2025-52903",
      "publishedDate": "2025-06-26T18:16:32.203Z",
      "lastModifiedDate": "2025-06-30T12:54:57.857Z",
      "description": "File Browser provides a file managing interface within a specified directory and it can be used to upload, delete, preview, rename and edit files. In version 2.32.0, the Command Execution feature of File Browser only allows the execution of shell command which have been predefined on a user-specific allowlist. Many tools allow the execution of arbitrary different commands, rendering this limitation void. The concrete impact depends on the commands being granted to the attacker, but the large number of standard commands allowing the execution of subcommands makes it likely that every user having the `Execute commands` permissions can exploit this vulnerability. Everyone who can exploit it will have full code execution rights with the uid of the server process. Until this issue is fixed, the maintainers recommend to completely disable `Execute commands` for all accounts. Since the command execution is an inherently dangerous feature that is not used by all deployments, it should be possible to completely disable it in the application's configuration. As a defense-in-depth measure, organizations not requiring command execution should operate the Filebrowser from a distroless container image. A patch version has been pushed to disable the feature for all existent installations, and making it opt-in. A warning has been added to the documentation and is printed on the console if the feature is enabled. Due to the project being in maintenance-only mode, the bug has not been fixed. The fix is tracked on pull request 5199.",
      "severity": 8.1,
      "references": [
        {
          "url": "https://github.com/filebrowser/filebrowser/security/advisories/GHSA-3q2w-42mv-cph4",
          "type": "reference"
        },
        {
          "url": "https://github.com/filebrowser/filebrowser/issues/5199",
          "type": "reference"
        },
        {
          "url": "https://github.com/GoogleContainerTools/distroless",
          "type": "reference"
        },
        {
          "url": "https://manpages.debian.org/bookworm/util-linux/prlimit.1.en.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "filebrowser",
          "product": "filebrowser",
          "versions": [
            {
              "version": "< 2.33.10",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-77: Improper Neutralization of Special Elements used in a Command ('Command Injection')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-6908",
      "publishedDate": "2025-06-30T13:02:07.209Z",
      "lastModifiedDate": "2025-06-30T13:02:07.209Z",
      "description": "A vulnerability, which was classified as critical, was found in PHPGurukul Old Age Home Management System 1.0. Affected is an unknown function of the file /admin/edit-services.php. The manipulation of the argument sertitle leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
      "severity": 6.3,
      "references": [
        {
          "url": "https://vuldb.com/?id.314400",
          "type": "reference"
        },
        {
          "url": "https://vuldb.com/?ctiid.314400",
          "type": "reference"
        },
        {
          "url": "https://vuldb.com/?submit.604928",
          "type": "reference"
        },
        {
          "url": "https://github.com/f1rstb100d/myCVE/issues/91",
          "type": "poc"
        },
        {
          "url": "https://phpgurukul.com/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "PHPGurukul",
          "product": "Old Age Home Management System",
          "versions": [
            {
              "version": "1.0",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "SQL Injection",
        "Injection"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}