{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 1,
    "last_updated": "2025-09-03T05:10:02.414005",
    "severity_distribution": {
      "critical": 0,
      "high": 0,
      "medium": 0,
      "low": 0,
      "none": 1
    }
  },
  "cves": [
    {
      "id": "CVE-2025-9785",
      "publishedDate": "2025-09-03T04:14:07.424Z",
      "lastModifiedDate": "2025-09-03T04:14:07.424Z",
      "description": "PaperCut Print Deploy is an optional component that integrates with PaperCut NG/MF which simplifies printer deployment and management. When the component is deployed to an environment, the customer has an option to configure the system to use a self-signed certificate. If the customer does not fully configure the system to leverage the trust database on the clients, it opens up the communication between clients and the server to man-in-the-middle attacks. \n\nIt was discovered that certain parts of the documentation related to the configuration of SSL in Print Deploy were lacking, which could potentially contribute to a misconfiguration of the Print Deploy client installation. PaperCut strongly recommends to use valid certificates to secure installations and to follow the updated documentation to ensure the correct SSL configuration. Those who use private CAs and/or self-signed certificates should make sure to copy their Certification Authority certificate, or their self signed certificate if using only one, to the trust store of their operating system and to the Java key store",
      "severity": "N/A",
      "references": [
        {
          "url": "https://papercut.com/Main/papercut-ng-mf-security-bulletin-september-2025/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "defaultStatus": "unaffected",
          "modules": [
            "Print Deploy"
          ],
          "platforms": [
            "Windows",
            "Linux",
            "MacOS"
          ],
          "product": "Print Deploy",
          "vendor": "PaperCut",
          "versions": [
            {
              "changes": [
                {
                  "at": "1.9.2917",
                  "status": "unaffected"
                }
              ],
              "lessThan": "1.9.2917",
              "status": "affected",
              "version": "0",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-295 Improper Certificate Validation"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}