{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 7,
    "last_updated": "2025-10-22T18:39:11.125301",
    "severity_distribution": {
      "critical": 0,
      "high": 1,
      "medium": 3,
      "low": 2,
      "none": 1
    }
  },
  "cves": [
    {
      "id": "CVE-2025-61752",
      "publishedDate": "2025-10-21T20:03:09.540Z",
      "lastModifiedDate": "2025-10-22T18:34:45.428Z",
      "description": "Vulnerability in the Oracle WebLogic Server product of Oracle Fusion Middleware (component: Core).  Supported versions that are affected are 14.1.1.0.0 and  14.1.2.0.0. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP/2 to compromise Oracle WebLogic Server.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of Oracle WebLogic Server. CVSS 3.1 Base Score 7.5 (Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).",
      "severity": 7.5,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle WebLogic Server",
          "versions": [
            {
              "version": "14.1.1.0.0",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "14.1.2.0.0",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP/2 to compromise Oracle WebLogic Server.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of Oracle WebLogic Server."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-61754",
      "publishedDate": "2025-10-21T20:03:10.204Z",
      "lastModifiedDate": "2025-10-22T18:24:54.553Z",
      "description": "Vulnerability in the Oracle BI Publisher product of Oracle Analytics (component: Web Service API).  Supported versions that are affected are 7.6.0.0.0 and  8.2.0.0.0. Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle BI Publisher.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle BI Publisher accessible data. CVSS 3.1 Base Score 6.5 (Confidentiality impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).",
      "severity": 6.5,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle BI Publisher",
          "versions": [
            {
              "version": "7.6.0.0.0",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.2.0.0.0",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle BI Publisher.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle BI Publisher accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-61753",
      "publishedDate": "2025-10-21T20:03:09.866Z",
      "lastModifiedDate": "2025-10-22T18:34:03.428Z",
      "description": "Vulnerability in the Oracle Scripting product of Oracle E-Business Suite (component: Miscellaneous).  Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Scripting.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Scripting, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Scripting accessible data as well as  unauthorized read access to a subset of Oracle Scripting accessible data. CVSS 3.1 Base Score 6.1 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).",
      "severity": 6.1,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Scripting",
          "versions": [
            {
              "version": "12.2.3",
              "status": "affected",
              "lessThanOrEqual": "12.2.14",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Scripting.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Scripting, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Scripting accessible data as well as  unauthorized read access to a subset of Oracle Scripting accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-61750",
      "publishedDate": "2025-10-21T20:03:08.840Z",
      "lastModifiedDate": "2025-10-22T18:22:05.718Z",
      "description": "Vulnerability in the PeopleSoft Enterprise PeopleTools product of Oracle PeopleSoft (component: Query).  Supported versions that are affected are 8.61 and  8.62. Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise PeopleSoft Enterprise PeopleTools.  Successful attacks of this vulnerability can result in  unauthorized read access to a subset of PeopleSoft Enterprise PeopleTools accessible data. CVSS 3.1 Base Score 4.3 (Confidentiality impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N).",
      "severity": 4.3,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "PeopleSoft Enterprise PeopleTools",
          "versions": [
            {
              "version": "8.61",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.62",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise PeopleSoft Enterprise PeopleTools.  Successful attacks of this vulnerability can result in  unauthorized read access to a subset of PeopleSoft Enterprise PeopleTools accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-61748",
      "publishedDate": "2025-10-21T20:03:08.113Z",
      "lastModifiedDate": "2025-10-22T18:23:18.544Z",
      "description": "Vulnerability in the Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition product of Oracle Java SE (component: Libraries).  Supported versions that are affected are Oracle Java SE: 21.0.8 and  25; Oracle GraalVM for JDK: 21.0.8; Oracle GraalVM Enterprise Edition: 21.3.15. Difficult to exploit vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition.  Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition accessible data. Note: This vulnerability can be exploited by using APIs in the specified Component, e.g., through a web service which supplies data to the APIs. This vulnerability also applies to Java deployments, typically in clients running sandboxed Java Web Start applications or sandboxed Java applets, that load and run untrusted code (e.g., code that comes from the internet) and rely on the Java sandbox for security. CVSS 3.1 Base Score 3.7 (Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:L/A:N).",
      "severity": 3.7,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Java SE",
          "versions": [
            {
              "version": "21.0.8",
              "status": "affected"
            },
            {
              "version": "25",
              "status": "affected"
            }
          ]
        },
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle GraalVM for JDK",
          "versions": [
            {
              "version": "21.0.8",
              "status": "affected"
            }
          ]
        },
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle GraalVM Enterprise Edition",
          "versions": [
            {
              "version": "21.3.15",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "Difficult to exploit vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition.  Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-61749",
      "publishedDate": "2025-10-21T20:03:08.487Z",
      "lastModifiedDate": "2025-10-22T18:21:18.400Z",
      "description": "Vulnerability in the Unified Audit component of Oracle Database Server.  Supported versions that are affected are 23.4-23.9. Easily exploitable vulnerability allows high privileged attacker having DBA privilege with network access via Oracle Net to compromise Unified Audit.  Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Unified Audit accessible data. CVSS 3.1 Base Score 2.7 (Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:L/A:N).",
      "severity": 2.7,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Database Server",
          "versions": [
            {
              "version": "23.4",
              "status": "affected",
              "lessThanOrEqual": "23.9",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows high privileged attacker having DBA privilege with network access via Oracle Net to compromise Unified Audit.  Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Unified Audit accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-58921",
      "publishedDate": "2025-10-22T14:32:34.600Z",
      "lastModifiedDate": "2025-10-22T18:31:15.558Z",
      "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Arevico WP Tactical Popup wp-tactical-popup allows Reflected XSS.This issue affects WP Tactical Popup: from n/a through <= 1.1.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://vdp.patchstack.com/database/Wordpress/Plugin/wp-tactical-popup/vulnerability/wordpress-wp-tactical-popup-plugin-1-1-reflected-cross-site-scripting-xss-vulnerability",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "collectionURL": "https://wordpress.org/plugins",
          "defaultStatus": "unaffected",
          "packageName": "wp-tactical-popup",
          "product": "WP Tactical Popup",
          "vendor": "Arevico",
          "versions": [
            {
              "lessThanOrEqual": "<= 1.1",
              "status": "affected",
              "version": "n/a",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}