{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 4,
    "last_updated": "2025-07-21T20:32:30.780703",
    "severity_distribution": {
      "critical": 0,
      "high": 2,
      "medium": 0,
      "low": 0,
      "none": 2
    }
  },
  "cves": [
    {
      "id": "CVE-2025-53528",
      "publishedDate": "2025-07-21T20:15:17.464Z",
      "lastModifiedDate": "2025-07-21T20:15:17.464Z",
      "description": "Cadwyn creates production-ready community-driven modern Stripe-like API versioning in FastAPI. In versions 5.4.3 and below, the version parameter of the \"/docs\" endpoint is vulnerable to a Reflected XSS (Cross-Site Scripting) attack. This XSS would notably allow an attacker to execute JavaScript code on a user's session for any application based on Cadwyn via a one-click attack. The vulnerability has been fixed in version 5.4.4.",
      "severity": 7.6,
      "references": [
        {
          "url": "https://github.com/zmievsa/cadwyn/security/advisories/GHSA-2gxp-6r36-m97r",
          "type": "reference"
        },
        {
          "url": "https://github.com/zmievsa/cadwyn/commit/b424ecd57cd8dabbc8fe39b8f8ccafea629c7728",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "zmievsa",
          "product": "cadwyn",
          "versions": [
            {
              "version": "< 5.4.4",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-53832",
      "publishedDate": "2025-07-21T20:18:02.755Z",
      "lastModifiedDate": "2025-07-21T20:18:02.755Z",
      "description": "Lara Translate MCP Server is a Model Context Protocol (MCP) Server for Lara Translate API. Versions 0.0.11 and below contain a command injection vulnerability which exists in the @translated/lara-mcp MCP Server. The vulnerability is caused by the unsanitized use of input parameters within a call to child_process.exec, enabling an attacker to inject arbitrary system commands. Successful exploitation can lead to remote code execution under the server process's privileges. The server constructs and executes shell commands using unvalidated user input directly within command-line strings. This introduces the possibility of shell metacharacter injection (|, >, &&, etc.). This vulnerability is fixed in version 0.0.12.",
      "severity": 7.5,
      "references": [
        {
          "url": "https://github.com/translated/lara-mcp/security/advisories/GHSA-xj5p-8h7g-76m7",
          "type": "reference"
        },
        {
          "url": "https://github.com/translated/lara-mcp/commit/e534ef690adf390e4ac862a200b2a83f6cf45944",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "translated",
          "product": "lara-mcp",
          "versions": [
            {
              "version": "< 0.0.12",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-77: Improper Neutralization of Special Elements used in a Command ('Command Injection')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-7298",
      "publishedDate": "2025-07-21T20:00:52.121Z",
      "lastModifiedDate": "2025-07-21T20:12:52.699Z",
      "description": "IrfanView CADImage Plugin DXF File Parsing Out-Of-Bounds Read Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of IrfanView CADImage Plugin. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of DXF files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-26246.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-542/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "IrfanView",
          "product": "IrfanView",
          "versions": [
            {
              "version": "4.70.0.0",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-125: Out-of-bounds Read"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-7293",
      "publishedDate": "2025-07-21T20:00:47.766Z",
      "lastModifiedDate": "2025-07-21T20:18:01.407Z",
      "description": "IrfanView CADImage Plugin DXF File Parsing Memory Corruption Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of IrfanView CADImage Plugin. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of DXF files. The issue results from the lack of proper validation of user-supplied data, which can result in a memory corruption condition. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-26229.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-541/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "IrfanView",
          "product": "IrfanView",
          "versions": [
            {
              "version": "4.70.0.0",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-119: Improper Restriction of Operations within the Bounds of a Memory Buffer"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}