{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 3,
    "last_updated": "2026-02-25T22:17:37.082869",
    "severity_distribution": {
      "critical": 0,
      "high": 0,
      "medium": 0,
      "low": 0,
      "none": 3
    }
  },
  "cves": [
    {
      "id": "CVE-2026-27495",
      "publishedDate": "2026-02-25T22:10:04.054Z",
      "lastModifiedDate": "2026-02-25T22:10:04.054Z",
      "description": "n8n is an open source workflow automation platform. Prior to versions 2.10.1, 2.9.3, and 1.123.22, an authenticated user with permission to create or modify workflows could exploit a vulnerability in the JavaScript Task Runner sandbox to execute arbitrary code outside the sandbox boundary. On instances using internal Task Runners (default runner mode), this could result in full compromise of the n8n host. On instances using external Task Runners, the attacker might gain access to or impact other task executed on the Task Runner. Task Runners must be enabled using `N8N_RUNNERS_ENABLED=true`. The issue has been fixed in n8n versions 2.10.1, 2.9.3, and 1.123.22. Users should upgrade to one of these versions or later to remediate the vulnerability. If upgrading is not immediately possible, administrators should consider the following temporary mitigations. Limit workflow creation and editing permissions to fully trusted users only, and/or use external runner mode (`N8N_RUNNERS_MODE=external`) to limit the blast radius. These workarounds do not fully remediate the risk and should only be used as short-term mitigation measures.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://github.com/n8n-io/n8n/security/advisories/GHSA-jjpj-p2wh-qf23",
          "type": "reference"
        },
        {
          "url": "https://docs.n8n.io/hosting/configuration/task-runners",
          "type": "reference"
        },
        {
          "url": "https://github.com/n8n-io/n8n/releases/tag/n8n@1.123.22",
          "type": "reference"
        },
        {
          "url": "https://github.com/n8n-io/n8n/releases/tag/n8n@2.10.1",
          "type": "reference"
        },
        {
          "url": "https://github.com/n8n-io/n8n/releases/tag/n8n@2.9.3",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "n8n-io",
          "product": "n8n",
          "versions": [
            {
              "version": "< 1.123.22",
              "status": "affected"
            },
            {
              "version": ">= 2.0.0, < 2.9.3",
              "status": "affected"
            },
            {
              "version": ">= 2.10.0, < 2.10.1",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-94: Improper Control of Generation of Code ('Code Injection')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2026-27494",
      "publishedDate": "2026-02-25T22:08:00.520Z",
      "lastModifiedDate": "2026-02-25T22:08:00.520Z",
      "description": "n8n is an open source workflow automation platform. Prior to versions 2.10.1, 2.9.3, and 1.123.22, an authenticated user with permission to create or modify workflows could use the Python Code node to escape the sandbox. The sandbox did not sufficiently restrict access to certain built-in Python objects, allowing an attacker to exfiltrate file contents or achieve RCE. On instances using internal Task Runners (default runner mode), this could result in full compromise of the n8n host. On instances using external Task Runners, the attacker might gain access to or impact other task executed on the Task Runner. Task Runners must be enabled using `N8N_RUNNERS_ENABLED=true`. The issue has been fixed in n8n versions 2.10.1, 2.9.3, and 1.123.22. Users should upgrade to this version or later to remediate the vulnerability. If upgrading is not immediately possible, administrators should consider the following temporary mitigations. Limit workflow creation and editing permissions to fully trusted users only., and/or disable the Code node by adding `n8n-nodes-base.code` to the `NODES_EXCLUDE` environment variable. These workarounds do not fully remediate the risk and should only be used as short-term mitigation measures.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://github.com/n8n-io/n8n/security/advisories/GHSA-mmgg-m5j7-f83h",
          "type": "reference"
        },
        {
          "url": "https://github.com/n8n-io/n8n/releases/tag/n8n@1.123.22",
          "type": "reference"
        },
        {
          "url": "https://github.com/n8n-io/n8n/releases/tag/n8n@2.10.1",
          "type": "reference"
        },
        {
          "url": "https://github.com/n8n-io/n8n/releases/tag/n8n@2.9.3",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "n8n-io",
          "product": "n8n",
          "versions": [
            {
              "version": "< 1.123.22",
              "status": "affected"
            },
            {
              "version": ">= 2.0.0, < 2.9.3",
              "status": "affected"
            },
            {
              "version": ">= 2.10.0, < 2.10.1",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-497: Exposure of Sensitive System Information to an Unauthorized Control Sphere"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2026-27493",
      "publishedDate": "2026-02-25T22:05:00.686Z",
      "lastModifiedDate": "2026-02-25T22:05:00.686Z",
      "description": "n8n is an open source workflow automation platform. Prior to versions 2.10.1, 2.9.3, and 1.123.22, a second-order expression injection vulnerability existed in n8n's Form nodes that could allow an unauthenticated attacker to inject and evaluate arbitrary n8n expressions by submitting crafted form data. When chained with an expression sandbox escape, this could escalate to remote code execution on the n8n host. The vulnerability requires a specific workflow configuration to be exploitable. First, a form node with a field interpolating a value provided by an unauthenticated user, e.g. a form submitted value. Second, the field value must begin with an `=` character, which caused n8n to treat it as an expression and triggered a double-evaluation of the field content. There is no practical reason for a workflow designer to prefix a field with `=` intentionally — the character is not rendered in the output, so the result would not match the designer's expectations. If added accidentally, it would be noticeable and very unlikely to persist. An unauthenticated attacker would need to either know about this specific circumstance on a target instance or discover a matching form by chance. Even when the preconditions are met, the expression injection alone is limited to data accessible within the n8n expression context. Escalation to remote code execution requires chaining with a separate sandbox escape vulnerability. The issue has been fixed in n8n versions 2.10.1, 2.9.3, and 1.123.22. Users should upgrade to one of these versions or later to remediate the vulnerability. If upgrading is not immediately possible, administrators should consider the following temporary mitigations. Review usage of form nodes manually for above mentioned preconditions, disable the Form node by adding `n8n-nodes-base.form` to the `NODES_EXCLUDE` environment variable, and/or disable the Form Trigger node by adding `n8n-nodes-base.formTrigger` to the `NODES_EXCLUDE` environment variable. These workarounds do not fully remediate the risk and should only be used as short-term mitigation measures.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://github.com/n8n-io/n8n/security/advisories/GHSA-75g8-rv7v-32f7",
          "type": "reference"
        },
        {
          "url": "https://github.com/n8n-io/n8n/issues/19",
          "type": "reference"
        },
        {
          "url": "https://github.com/n8n-io/n8n/commit/562d867483e871b0f1e31776252e23bd721df75b",
          "type": "reference"
        },
        {
          "url": "https://github.com/n8n-io/n8n/releases/tag/n8n@1.123.22",
          "type": "reference"
        },
        {
          "url": "https://github.com/n8n-io/n8n/releases/tag/n8n@2.10.1",
          "type": "reference"
        },
        {
          "url": "https://github.com/n8n-io/n8n/releases/tag/n8n@2.9.3",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "n8n-io",
          "product": "n8n",
          "versions": [
            {
              "version": "< 1.123.22",
              "status": "affected"
            },
            {
              "version": ">= 2.0.0, < 2.9.3",
              "status": "affected"
            },
            {
              "version": ">= 2.10.0, < 2.10.1",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-94: Improper Control of Generation of Code ('Code Injection')",
        "CWE-95: Improper Neutralization of Directives in Dynamically Evaluated Code ('Eval Injection')"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}