{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 1,
    "last_updated": "2025-11-13T23:41:45.352506",
    "severity_distribution": {
      "critical": 0,
      "high": 1,
      "medium": 0,
      "low": 0,
      "none": 0
    }
  },
  "cves": [
    {
      "id": "CVE-2025-64530",
      "publishedDate": "2025-11-13T23:02:45.740Z",
      "lastModifiedDate": "2025-11-13T23:02:45.740Z",
      "description": "Apollo Federation is an architecture for declaratively composing APIs into a unified graph. A vulnerability in versions of Apollo Federation's composition logic prior to 2.9.5, 2.10.4, 2.11.5, and 2.12.1 allowed some queries to Apollo Router to improperly bypass access controls on types/fields. Apollo Federation incorrectly allowed user-defined access control directives on interface types/fields, which could be bypassed by instead querying the implementing object types/fields in Apollo Router via inline fragments, for example. A fix to versions 2.9.5, 2.10.4, 2.11.5, and 2.12.1 of composition logic in Federation now disallows interfaces types and fields to contain user-defined access control directives. Some workarounds are available. Users of Apollo Rover with an unpatched composition version or are using the Apollo Studio build pipeline with Federation version 2.8 or below should manually copy the access control requirements on interface types/fields to each implementing object type/field where appropriate. Do not remove those access control requirements from the interface types/fields, as unpatched Apollo Composition will not automatically generate them in the supergraph schema. Customers not using Apollo Router access control features (`@authenticated`, `@requiresScopes`, or `@policy` directives) or not specifying access control requirements on interface types/fields are not affected and do not need to take action.",
      "severity": 7.5,
      "references": [
        {
          "url": "https://github.com/apollographql/federation/security/advisories/GHSA-mx7m-j9xf-62hw",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "apollographql",
          "product": "federation",
          "versions": [
            {
              "version": "< 2.9.5",
              "status": "affected"
            },
            {
              "version": ">= 2.10.0-preview.0, < 2.10.4",
              "status": "affected"
            },
            {
              "version": ">= 2.11.0-preview.0, < 2.11.5",
              "status": "affected"
            },
            {
              "version": ">= 2.12.0-preview.0, 2.12.1",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-288: Authentication Bypass Using an Alternate Path or Channel"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}