{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 2,
    "last_updated": "2025-09-18T18:39:10.455111",
    "severity_distribution": {
      "critical": 0,
      "high": 0,
      "medium": 0,
      "low": 0,
      "none": 2
    }
  },
  "cves": [
    {
      "id": "CVE-2025-7989",
      "publishedDate": "2025-09-17T20:52:06.445Z",
      "lastModifiedDate": "2025-09-18T18:05:00.465Z",
      "description": "Ashlar-Vellum Cobalt AR File Parsing Out-Of-Bounds Read Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Ashlar-Vellum Cobalt. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of AR files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated data structure. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25943.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-640/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Ashlar-Vellum",
          "product": "Cobalt",
          "versions": [
            {
              "version": "12 SP1",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-125: Out-of-bounds Read"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-7986",
      "publishedDate": "2025-09-17T20:52:01.945Z",
      "lastModifiedDate": "2025-09-18T18:09:52.128Z",
      "description": "Ashlar-Vellum Graphite VC6 File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Ashlar-Vellum Graphite. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of VC6 files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25755.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-639/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Ashlar-Vellum",
          "product": "Graphite",
          "versions": [
            {
              "version": "13.0",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-787: Out-of-bounds Write"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}