{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 2,
    "last_updated": "2025-04-06T21:10:55.391705",
    "severity_distribution": {
      "critical": 0,
      "high": 0,
      "medium": 0,
      "low": 0,
      "none": 2
    }
  },
  "cves": [
    {
      "id": "CVE-2025-32013",
      "publishedDate": "2025-04-06T20:07:05.624Z",
      "lastModifiedDate": "2025-04-06T20:07:05.624Z",
      "description": "LNbits is a Lightning wallet and accounts system. A Server-Side Request Forgery (SSRF) vulnerability has been discovered in LNbits' LNURL authentication handling functionality. When processing LNURL authentication requests, the application accepts a callback URL parameter and makes an HTTP request to that URL using the httpx library with redirect following enabled. The application doesn't properly validate the callback URL, allowing attackers to specify internal network addresses and access internal resources.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://github.com/lnbits/lnbits/security/advisories/GHSA-qp8j-p87f-c8cc",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "lnbits",
          "product": "lnbits",
          "versions": [
            {
              "version": "<= 0.12.12",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-918: Server-Side Request Forgery (SSRF)"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-31492",
      "publishedDate": "2025-04-06T20:02:20.511Z",
      "lastModifiedDate": "2025-04-06T20:02:20.511Z",
      "description": "mod_auth_openidc is an OpenID Certified authentication and authorization module for the Apache 2.x HTTP server that implements the OpenID Connect Relying Party functionality. Prior to 2.4.16.11, a bug in a mod_auth_openidc results in disclosure of protected content to unauthenticated users. The conditions for disclosure are an OIDCProviderAuthRequestMethod POST, a valid account, and there mustn't be any application-level gateway (or load balancer etc) protecting the server. When you request a protected resource, the response includes the HTTP status, the HTTP headers, the intended response (the self-submitting form), and the protected resource (with no headers). This is an example of a request for a protected resource, including all the data returned. In the case where mod_auth_openidc returns a form, it has to return OK from check_userid so as not to go down the error path in httpd. This means httpd will try to issue the protected resource. oidc_content_handler is called early, which has the opportunity to prevent the normal output being issued by httpd. oidc_content_handler has a number of checks for when it intervenes, but it doesn't check for this case, so the handler returns DECLINED. Consequently, httpd appends the protected content to the response. The issue has been patched in mod_auth_openidc versions >= 2.4.16.11.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://github.com/OpenIDC/mod_auth_openidc/security/advisories/GHSA-59jp-rwph-878r",
          "type": "reference"
        },
        {
          "url": "https://github.com/OpenIDC/mod_auth_openidc/commit/b59b8ad63411857090ba1088e23fe414c690c127",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "OpenIDC",
          "product": "mod_auth_openidc",
          "versions": [
            {
              "version": "< 2.4.16.11",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-200: Exposure of Sensitive Information to an Unauthorized Actor"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}