{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 2,
    "last_updated": "2025-09-18T06:32:01.000220",
    "severity_distribution": {
      "critical": 0,
      "high": 0,
      "medium": 0,
      "low": 0,
      "none": 2
    }
  },
  "cves": [
    {
      "id": "CVE-2023-49565",
      "publishedDate": "2025-09-18T06:11:53.618Z",
      "lastModifiedDate": "2025-09-18T06:11:53.618Z",
      "description": "The cbis_manager Podman container is vulnerable to remote command execution via the /api/plugins endpoint. Improper sanitization of the HTTP Headers X-FILENAME, X-PAGE, and X-FIELD allows for command injection. These headers are directly utilized within the subprocess.Popen Python function without adequate validation, enabling a remote attacker to execute arbitrary commands on the underlying system by crafting malicious header values within an HTTP request to the affected endpoint.\nThe web service executes with root privileges within the container environment, the demonstrated remote code execution permits an attacker to acquire elevated privileges for the command execution.\nRestricting access to the management network with an external firewall can partially mitigate this risk.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.nokia.com/about-us/security-and-privacy/product-security-advisory/CVE-2023-49565/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Nokia",
          "product": "CBIS,NCS",
          "versions": [
            {
              "version": "CBIS 22, NCS 22.12, NCS 23.10",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2023-49564",
      "publishedDate": "2025-09-18T06:10:27.787Z",
      "lastModifiedDate": "2025-09-18T06:10:27.787Z",
      "description": "The CBIS/NCS Manager API is vulnerable to an authentication bypass. By sending a specially crafted HTTP header, an unauthenticated user can gain unauthorized access to API functions. This flaw allows attackers to reach restricted or sensitive endpoints of the HTTP API without providing any valid credentials. The root cause of this vulnerability lies in a weak verification mechanism within the authentication implementation present in the Nginx Podman container on the CBIS/NCS Manager host machine.\nThe risk can be partially mitigated by restricting access to the management network using external firewall.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.nokia.com/about-us/security-and-privacy/product-security-advisory/CVE-2023-49564/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Nokia",
          "product": "CBIS,NCS",
          "versions": [
            {
              "version": "CBIS 22, NCS 22.12",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}