{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 35,
    "last_updated": "2025-12-23T21:26:09.140259",
    "severity_distribution": {
      "critical": 0,
      "high": 1,
      "medium": 0,
      "low": 0,
      "none": 34
    }
  },
  "cves": [
    {
      "id": "CVE-2021-47735",
      "publishedDate": "2025-12-23T19:34:09.077Z",
      "lastModifiedDate": "2025-12-23T21:20:25.731Z",
      "description": "CMSimple 5.4 contains an authenticated remote code execution vulnerability that allows logged-in attackers to inject malicious PHP code into template files. Attackers can exploit the template editing functionality by crafting a reverse shell payload and saving it through the template editing endpoint with a valid CSRF token.",
      "severity": 8.8,
      "references": [
        {
          "url": "https://www.exploit-db.com/exploits/50356",
          "type": "poc"
        },
        {
          "url": "https://www.cmsimple.org/",
          "type": "reference"
        },
        {
          "url": "https://www.vulncheck.com/advisories/cmsimple-authenticated-remote-code-execution-via-template-editing",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Cmsimple",
          "product": "Cmsimple",
          "versions": [
            {
              "version": "5.4",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "Improper Control of Generation of Code ('Code Injection')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14415",
      "publishedDate": "2025-12-23T21:24:19.116Z",
      "lastModifiedDate": "2025-12-23T21:24:19.116Z",
      "description": "Soda PDF Desktop Launch Insufficient UI Warning Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Soda PDF Desktop. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the implementation of the Launch action. The issue results from allowing the execution of dangerous script without user warning. An attacker can leverage this vulnerability to execute code in the context of the current user. Was ZDI-CAN-27494.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1088/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Soda PDF",
          "product": "Desktop",
          "versions": [
            {
              "version": "14.0.509.23030",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-356: Product UI does not Warn User of Unsafe Actions"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14413",
      "publishedDate": "2025-12-23T21:24:11.632Z",
      "lastModifiedDate": "2025-12-23T21:24:11.632Z",
      "description": "Soda PDF Desktop CBZ File Parsing Directory Traversal Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Soda PDF Desktop. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of CBZ files. The issue results from the lack of proper validation of a user-supplied path prior to using it in file operations. An attacker can leverage this vulnerability to execute code in the context of the current user. Was ZDI-CAN-27509.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1086/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Soda PDF",
          "product": "Desktop",
          "versions": [
            {
              "version": "14.0.509.23030",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-22: Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14412",
      "publishedDate": "2025-12-23T21:24:04.860Z",
      "lastModifiedDate": "2025-12-23T21:24:04.860Z",
      "description": "Soda PDF Desktop XLS File Insufficient UI Warning Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Soda PDF Desktop. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the handling of XLS files. The issue results from allowing the execution of dangerous script without user warning. An attacker can leverage this vulnerability to execute code in the context of the current user. Was ZDI-CAN-27495.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1085/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Soda PDF",
          "product": "Desktop",
          "versions": [
            {
              "version": "14.0.509.23030",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-356: Product UI does not Warn User of Unsafe Actions"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14411",
      "publishedDate": "2025-12-23T21:24:00.216Z",
      "lastModifiedDate": "2025-12-23T21:24:00.216Z",
      "description": "Soda PDF Desktop PDF File Parsing Out-Of-Bounds Read Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of Soda PDF Desktop. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of PDF files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-27140.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1084/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Soda PDF",
          "product": "Desktop",
          "versions": [
            {
              "version": "14.0.509.23030",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-125: Out-of-bounds Read"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14410",
      "publishedDate": "2025-12-23T21:23:54.044Z",
      "lastModifiedDate": "2025-12-23T21:23:54.044Z",
      "description": "Soda PDF Desktop PDF File Parsing Out-Of-Bounds Read Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of Soda PDF Desktop. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of PDF files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-27142.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1083/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Soda PDF",
          "product": "Desktop",
          "versions": [
            {
              "version": "14.0.506.23016",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-125: Out-of-bounds Read"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14409",
      "publishedDate": "2025-12-23T21:23:49.052Z",
      "lastModifiedDate": "2025-12-23T21:23:49.052Z",
      "description": "Soda PDF Desktop PDF File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Soda PDF Desktop. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of PDF files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-27120.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1082/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Soda PDF",
          "product": "Desktop",
          "versions": [
            {
              "version": "14.0.506.23016",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-787: Out-of-bounds Write"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14408",
      "publishedDate": "2025-12-23T21:23:44.886Z",
      "lastModifiedDate": "2025-12-23T21:23:44.886Z",
      "description": "Soda PDF Desktop PDF File Parsing Out-Of-Bounds Read Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of Soda PDF Desktop. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of PDF files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-27143.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1081/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Soda PDF",
          "product": "Desktop",
          "versions": [
            {
              "version": "14.0.509.23030",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-125: Out-of-bounds Read"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14407",
      "publishedDate": "2025-12-23T21:23:41.396Z",
      "lastModifiedDate": "2025-12-23T21:23:41.396Z",
      "description": "Soda PDF Desktop PDF File Parsing Memory Corruption Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of Soda PDF Desktop. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of PDF files. The issue results from the lack of proper validation of user-supplied data, which can result in a memory corruption condition. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-27141.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1080/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Soda PDF",
          "product": "Desktop",
          "versions": [
            {
              "version": "14.0.509.23030",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-119: Improper Restriction of Operations within the Bounds of a Memory Buffer"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14406",
      "publishedDate": "2025-12-23T21:23:36.076Z",
      "lastModifiedDate": "2025-12-23T21:23:36.076Z",
      "description": "Soda PDF Desktop Uncontrolled Search Path Element Local Privilege Escalation Vulnerability. This vulnerability allows local attackers to escalate privileges on affected installations of Soda PDF Desktop. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the configuration of OpenSSL. The product loads an OpenSSL configuration file from an unsecured location. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of SYSTEM. Was ZDI-CAN-25793.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1079/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Soda PDF",
          "product": "Desktop",
          "versions": [
            {
              "version": "14.0.437.22898",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-427: Uncontrolled Search Path Element"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14421",
      "publishedDate": "2025-12-23T21:22:59.811Z",
      "lastModifiedDate": "2025-12-23T21:22:59.811Z",
      "description": "pdfforge PDF Architect PDF File Parsing Out-Of-Bounds Read Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of pdfforge PDF Architect. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of PDF files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-27915.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1078/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "pdfforge",
          "product": "PDF Architect",
          "versions": [
            {
              "version": "9.1.74.23030",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-125: Out-of-bounds Read"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14420",
      "publishedDate": "2025-12-23T21:22:54.084Z",
      "lastModifiedDate": "2025-12-23T21:22:54.084Z",
      "description": "pdfforge PDF Architect CBZ File Parsing Directory Traversal Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of pdfforge PDF Architect. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of CBZ files. The issue results from the lack of proper validation of a user-supplied path prior to using it in file operations. An attacker can leverage this vulnerability to execute code in the context of the current user. Was ZDI-CAN-27514.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1077/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "pdfforge",
          "product": "PDF Architect",
          "versions": [
            {
              "version": "9.1.74.23030",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-22: Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14419",
      "publishedDate": "2025-12-23T21:22:50.077Z",
      "lastModifiedDate": "2025-12-23T21:22:50.077Z",
      "description": "pdfforge PDF Architect PDF File Parsing Memory Corruption Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of pdfforge PDF Architect. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of PDF files. The issue results from the lack of proper validation of user-supplied data, which can result in a memory corruption condition. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-27902.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1076/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "pdfforge",
          "product": "PDF Architect",
          "versions": [
            {
              "version": "9.1.74.23030",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-119: Improper Restriction of Operations within the Bounds of a Memory Buffer"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14418",
      "publishedDate": "2025-12-23T21:22:46.165Z",
      "lastModifiedDate": "2025-12-23T21:22:46.165Z",
      "description": "pdfforge PDF Architect XLS File Insufficient UI Warning Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of pdfforge PDF Architect. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the processing of XLS files. The issue results from allowing the execution of dangerous script without user warning. An attacker can leverage this vulnerability to execute code in the context of the current user. Was ZDI-CAN-27502.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1075/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "pdfforge",
          "product": "PDF Architect",
          "versions": [
            {
              "version": "9.1.74.23030",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-356: Product UI does not Warn User of Unsafe Actions"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14417",
      "publishedDate": "2025-12-23T21:22:39.324Z",
      "lastModifiedDate": "2025-12-23T21:22:39.324Z",
      "description": "pdfforge PDF Architect Launch Insufficient UI Warning Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of pdfforge PDF Architect. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the implementation of the Launch action. The issue results from allowing the execution of dangerous script without user warning. An attacker can leverage this vulnerability to execute code in the context of the current user. Was ZDI-CAN-27501.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1074/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "pdfforge",
          "product": "PDF Architect",
          "versions": [
            {
              "version": "9.1.74.23030",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-356: Product UI does not Warn User of Unsafe Actions"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14416",
      "publishedDate": "2025-12-23T21:22:31.525Z",
      "lastModifiedDate": "2025-12-23T21:22:31.525Z",
      "description": "pdfforge PDF Architect DOC File Insufficient UI Warning Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of pdfforge PDF Architect. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the processing of DOC files. The issue results from allowing the execution of dangerous script without user warning. An attacker can leverage this vulnerability to execute code in the context of the current user. Was ZDI-CAN-27503.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1073/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "pdfforge",
          "product": "PDF Architect",
          "versions": [
            {
              "version": "9.1.74.23030",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-356: Product UI does not Warn User of Unsafe Actions"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14405",
      "publishedDate": "2025-12-23T21:21:23.722Z",
      "lastModifiedDate": "2025-12-23T21:21:23.722Z",
      "description": "PDFsam Enhanced Uncontrolled Search Path Element Local Privilege Escalation Vulnerability. This vulnerability allows phyiscally-present attackers to escalate privileges on affected installations of PDFsam Enhanced. An attacker must first obtain the ability to mount a malicious drive onto the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the configuration of OpenSSL. The product loads an OpenSSL configuration file from an unsecured location. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of SYSTEM. Was ZDI-CAN-27867.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1093/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "PDFsam",
          "product": "Enhanced",
          "versions": [
            {
              "version": "7.0.76.15222",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-427: Uncontrolled Search Path Element"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14404",
      "publishedDate": "2025-12-23T21:21:19.483Z",
      "lastModifiedDate": "2025-12-23T21:21:19.483Z",
      "description": "PDFsam Enhanced XLS File Insufficient UI Warning Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of PDFsam Enhanced. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the processing of XLS files. The issue results from allowing the execution of dangerous script without user warning. An attacker can leverage this vulnerability to execute code in the context of the current user. Was ZDI-CAN-27498.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1092/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "PDFsam",
          "product": "Enhanced",
          "versions": [
            {
              "version": "7.0.76.15222",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-356: Product UI does not Warn User of Unsafe Actions"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14403",
      "publishedDate": "2025-12-23T21:21:15.464Z",
      "lastModifiedDate": "2025-12-23T21:21:15.464Z",
      "description": "PDFsam Enhanced Launch Insufficient UI Warning Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of PDFsam Enhanced. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the implementation of the Launch action. The issue results from allowing the execution of dangerous script without user warning. An attacker can leverage this vulnerability to execute code in the context of the current user. Was ZDI-CAN-27500.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1091/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "PDFsam",
          "product": "Enhanced",
          "versions": [
            {
              "version": "7.0.76.15222",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-356: Product UI does not Warn User of Unsafe Actions"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14402",
      "publishedDate": "2025-12-23T21:21:10.806Z",
      "lastModifiedDate": "2025-12-23T21:21:10.806Z",
      "description": "PDFsam Enhanced DOC File Insufficient UI Warning Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of PDFsam Enhanced. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the processing of DOC files. The issue results from allowing the execution of dangerous script without user warning. An attacker can leverage this vulnerability to execute code in the context of the current user. Was ZDI-CAN-27499.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1090/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "PDFsam",
          "product": "Enhanced",
          "versions": [
            {
              "version": "7.0.76.15222",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-356: Product UI does not Warn User of Unsafe Actions"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14401",
      "publishedDate": "2025-12-23T21:20:22.912Z",
      "lastModifiedDate": "2025-12-23T21:20:22.912Z",
      "description": "PDFsam Enhanced App Out-Of-Bounds Read Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of PDFsam Enhanced. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the handling of App objects. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-27260.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1089/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "PDFsam",
          "product": "Enhanced",
          "versions": [
            {
              "version": "7.0.76.15222",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-125: Out-of-bounds Read"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14500",
      "publishedDate": "2025-12-23T21:19:24.812Z",
      "lastModifiedDate": "2025-12-23T21:19:24.812Z",
      "description": "IceWarp14 X-File-Operation Command Injection Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of IceWarp. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the handling of the X-File-Operation header. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of SYSTEM. Was ZDI-CAN-27394.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1072/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "IceWarp",
          "product": "IceWarp",
          "versions": [
            {
              "version": "14.2.0.5",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-78: Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14499",
      "publishedDate": "2025-12-23T21:19:13.295Z",
      "lastModifiedDate": "2025-12-23T21:19:13.295Z",
      "description": "IceWarp gmaps Cross-Site Scripting Authentication Bypass Vulnerability. This vulnerability allows remote attackers to bypass authentication on affected installations of IceWarp. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the handling of a parameter passed to the gmaps webpage. The issue results from the lack of proper validation of user-supplied data, which can lead to the injection of an arbitrary script. An attacker can leverage this vulnerability to bypass authentication on the system. Was ZDI-CAN-25441.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1071/",
          "type": "reference"
        },
        {
          "url": "https://support.icewarp.com/hc/en-us/community/posts/40040542307729-EPOS-Update-2-build-8-14-2-0-8",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "IceWarp",
          "product": "IceWarp",
          "versions": [
            {
              "version": "14.2.0.5",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14501",
      "publishedDate": "2025-12-23T21:18:40.087Z",
      "lastModifiedDate": "2025-12-23T21:18:40.087Z",
      "description": "Sante PACS Server HTTP Content-Length Header Handling NULL Pointer Dereference Denial-of-Service Vulnerability. This vulnerability allows remote attackers to create a denial-of-service condition on affected installations of Sante PACS Server. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the handling of HTTP Content-Length header. The issue results from the lack of proper validation of a pointer prior to accessing it. An attacker can leverage this vulnerability to create a denial-of-service condition on the system. Was ZDI-CAN-26770.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1104/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Sante",
          "product": "PACS Server",
          "versions": [
            {
              "version": "4.2.2",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-476: NULL Pointer Dereference"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14498",
      "publishedDate": "2025-12-23T21:18:10.145Z",
      "lastModifiedDate": "2025-12-23T21:18:10.145Z",
      "description": "TradingView Desktop Electron Uncontrolled Search Path Local Privilege Escalation Vulnerability. This vulnerability allows local attackers to escalate privileges on affected installations of TradingView Desktop. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the configuration of the Electron framework. The product loads a script file from an unsecured location. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of a target user. Was ZDI-CAN-27395.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1070/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "TradingView",
          "product": "Desktop",
          "versions": [
            {
              "version": "2.11.0.7073",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-427: Uncontrolled Search Path Element"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14494",
      "publishedDate": "2025-12-23T21:17:17.387Z",
      "lastModifiedDate": "2025-12-23T21:17:17.387Z",
      "description": "RealDefense SUPERAntiSpyware Exposed Dangerous Function Local Privilege Escalation Vulnerability. This vulnerability allows local attackers to escalate privileges on affected installations of RealDefense SUPERAntiSpyware. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the SAS Core Service. The issue results from an exposed dangerous function. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of SYSTEM. Was ZDI-CAN-27676.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1163/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "RealDefense",
          "product": "SUPERAntiSpyware",
          "versions": [
            {
              "version": "10.0.1276 Free Edition",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-749: Exposed Dangerous Method or Function"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14491",
      "publishedDate": "2025-12-23T21:17:10.386Z",
      "lastModifiedDate": "2025-12-23T21:17:10.386Z",
      "description": "RealDefense SUPERAntiSpyware Exposed Dangerous Function Local Privilege Escalation Vulnerability. This vulnerability allows local attackers to escalate privileges on affected installations of RealDefense SUPERAntiSpyware. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the SAS Core Service. The issue results from an exposed dangerous function. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of SYSTEM. Was ZDI-CAN-27660.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1164/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "RealDefense",
          "product": "SUPERAntiSpyware",
          "versions": [
            {
              "version": "10.0.1276 Free Edition",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-749: Exposed Dangerous Method or Function"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14489",
      "publishedDate": "2025-12-23T21:17:00.522Z",
      "lastModifiedDate": "2025-12-23T21:17:00.522Z",
      "description": "RealDefense SUPERAntiSpyware Exposed Dangerous Function Local Privilege Escalation Vulnerability. This vulnerability allows local attackers to escalate privileges on affected installations of RealDefense SUPERAntiSpyware. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the SAS Core Service. The issue results from an exposed dangerous function. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of SYSTEM. Was ZDI-CAN-27658.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1165/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "RealDefense",
          "product": "SUPERAntiSpyware",
          "versions": [
            {
              "version": "10.0.1276 Free Edition",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-749: Exposed Dangerous Method or Function"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14490",
      "publishedDate": "2025-12-23T21:16:55.806Z",
      "lastModifiedDate": "2025-12-23T21:16:55.806Z",
      "description": "RealDefense SUPERAntiSpyware Exposed Dangerous Function Local Privilege Escalation Vulnerability. This vulnerability allows local attackers to escalate privileges on affected installations of RealDefense SUPERAntiSpyware. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the SAS Core Service. The issue results from an exposed dangerous function. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of SYSTEM. Was ZDI-CAN-27659.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1166/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "RealDefense",
          "product": "SUPERAntiSpyware",
          "versions": [
            {
              "version": "10.0.1276 Free Edition",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-749: Exposed Dangerous Method or Function"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14488",
      "publishedDate": "2025-12-23T21:16:51.772Z",
      "lastModifiedDate": "2025-12-23T21:16:51.772Z",
      "description": "RealDefense SUPERAntiSpyware Exposed Dangerous Function Local Privilege Escalation Vulnerability. This vulnerability allows local attackers to escalate privileges on affected installations of RealDefense SUPERAntiSpyware. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the SAS Core Service. The issue results from an exposed dangerous function. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of SYSTEM. Was ZDI-CAN-27657.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1167/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "RealDefense",
          "product": "SUPERAntiSpyware",
          "versions": [
            {
              "version": "10.0.1276 Free Edition",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-749: Exposed Dangerous Method or Function"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14497",
      "publishedDate": "2025-12-23T21:16:46.405Z",
      "lastModifiedDate": "2025-12-23T21:16:46.405Z",
      "description": "RealDefense SUPERAntiSpyware Exposed Dangerous Function Local Privilege Escalation Vulnerability. This vulnerability allows local attackers to escalate privileges on affected installations of RealDefense SUPERAntiSpyware. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the SAS Core Service. The issue results from an exposed dangerous function. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of SYSTEM. Was ZDI-CAN-27680.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1168/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "RealDefense",
          "product": "SUPERAntiSpyware",
          "versions": [
            {
              "version": "10.0.1276 Free Edition",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-749: Exposed Dangerous Method or Function"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14495",
      "publishedDate": "2025-12-23T21:16:41.860Z",
      "lastModifiedDate": "2025-12-23T21:16:41.860Z",
      "description": "RealDefense SUPERAntiSpyware Exposed Dangerous Function Local Privilege Escalation Vulnerability. This vulnerability allows local attackers to escalate privileges on affected installations of RealDefense SUPERAntiSpyware. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the SAS Core Service. The issue results from an exposed dangerous function. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of SYSTEM. Was ZDI-CAN-27677.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1169/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "RealDefense",
          "product": "SUPERAntiSpyware",
          "versions": [
            {
              "version": "10.0.1276 Free Edition",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-749: Exposed Dangerous Method or Function"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14493",
      "publishedDate": "2025-12-23T21:16:37.392Z",
      "lastModifiedDate": "2025-12-23T21:16:37.392Z",
      "description": "RealDefense SUPERAntiSpyware Exposed Dangerous Function Local Privilege Escalation Vulnerability. This vulnerability allows local attackers to escalate privileges on affected installations of RealDefense SUPERAntiSpyware. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the SAS Core Service. The issue results from an exposed dangerous function. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of SYSTEM. Was ZDI-CAN-27675.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1170/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "RealDefense",
          "product": "SUPERAntiSpyware",
          "versions": [
            {
              "version": "10.0.1276 Free Edition",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-749: Exposed Dangerous Method or Function"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14496",
      "publishedDate": "2025-12-23T21:16:32.028Z",
      "lastModifiedDate": "2025-12-23T21:16:32.028Z",
      "description": "RealDefense SUPERAntiSpyware Exposed Dangerous Function Local Privilege Escalation Vulnerability. This vulnerability allows local attackers to escalate privileges on affected installations of RealDefense SUPERAntiSpyware. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the SAS Core Service. The issue results from an exposed dangerous function. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of SYSTEM. Was ZDI-CAN-27678.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1171/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "RealDefense",
          "product": "SUPERAntiSpyware",
          "versions": [
            {
              "version": "10.0.1276 Free Edition",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-749: Exposed Dangerous Method or Function"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-14492",
      "publishedDate": "2025-12-23T21:16:27.430Z",
      "lastModifiedDate": "2025-12-23T21:16:27.430Z",
      "description": "RealDefense SUPERAntiSpyware Exposed Dangerous Function Local Privilege Escalation Vulnerability. This vulnerability allows local attackers to escalate privileges on affected installations of RealDefense SUPERAntiSpyware. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the SAS Core Service. The issue results from an exposed dangerous function. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of SYSTEM. Was ZDI-CAN-27668.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.zerodayinitiative.com/advisories/ZDI-25-1172/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "RealDefense",
          "product": "SUPERAntiSpyware",
          "versions": [
            {
              "version": "10.0.1276 Free Edition",
              "status": "affected"
            }
          ],
          "defaultStatus": "unknown"
        }
      ],
      "problemType": [
        "CWE-749: Exposed Dangerous Method or Function"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}