{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 6,
    "last_updated": "2025-10-22T19:36:16.403652",
    "severity_distribution": {
      "critical": 0,
      "high": 2,
      "medium": 1,
      "low": 1,
      "none": 2
    }
  },
  "cves": [
    {
      "id": "CVE-2025-53049",
      "publishedDate": "2025-10-21T20:02:57.900Z",
      "lastModifiedDate": "2025-10-22T19:28:53.415Z",
      "description": "Vulnerability in the Oracle Business Intelligence Enterprise Edition product of Oracle Analytics (component: Analytics Web Administration).  Supported versions that are affected are 7.6.0.0.0 and  8.2.0.0.0. Easily exploitable vulnerability allows high privileged attacker with network access via HTTP to compromise Oracle Business Intelligence Enterprise Edition.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Business Intelligence Enterprise Edition, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in takeover of Oracle Business Intelligence Enterprise Edition. CVSS 3.1 Base Score 8.4 (Confidentiality, Integrity and Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:H/UI:R/S:C/C:H/I:H/A:H).",
      "severity": 8.4,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Business Intelligence Enterprise Edition",
          "versions": [
            {
              "version": "7.6.0.0.0",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.2.0.0.0",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows high privileged attacker with network access via HTTP to compromise Oracle Business Intelligence Enterprise Edition.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Business Intelligence Enterprise Edition, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in takeover of Oracle Business Intelligence Enterprise Edition."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-53050",
      "publishedDate": "2025-10-21T20:02:58.236Z",
      "lastModifiedDate": "2025-10-22T19:29:46.834Z",
      "description": "Vulnerability in the PeopleSoft Enterprise PeopleTools product of Oracle PeopleSoft (component: Performance Monitor).  Supported versions that are affected are 8.60, 8.61 and  8.62. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise PeopleSoft Enterprise PeopleTools.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of PeopleSoft Enterprise PeopleTools. CVSS 3.1 Base Score 7.5 (Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).",
      "severity": 7.5,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "PeopleSoft Enterprise PeopleTools",
          "versions": [
            {
              "version": "8.60",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.61",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.62",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise PeopleSoft Enterprise PeopleTools.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of PeopleSoft Enterprise PeopleTools."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-53052",
      "publishedDate": "2025-10-21T20:02:58.997Z",
      "lastModifiedDate": "2025-10-22T19:34:10.471Z",
      "description": "Vulnerability in the Oracle Workflow product of Oracle E-Business Suite (component: Workflow Notification Mailer).  Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Workflow.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Workflow, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Workflow accessible data as well as  unauthorized read access to a subset of Oracle Workflow accessible data. CVSS 3.1 Base Score 6.1 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).",
      "severity": 6.1,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Workflow",
          "versions": [
            {
              "version": "12.2.3",
              "status": "affected",
              "lessThanOrEqual": "12.2.14",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Workflow.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Workflow, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Workflow accessible data as well as  unauthorized read access to a subset of Oracle Workflow accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-53051",
      "publishedDate": "2025-10-21T20:02:58.607Z",
      "lastModifiedDate": "2025-10-22T19:30:47.098Z",
      "description": "Vulnerability in the RDBMS Functional Index component of Oracle Database Server.  Supported versions that are affected are 23.4-23.9. Easily exploitable vulnerability allows high privileged attacker having SYSDBA privilege with network access via Oracle Net to compromise RDBMS Functional Index.  Successful attacks of this vulnerability can result in  unauthorized read access to a subset of RDBMS Functional Index accessible data. CVSS 3.1 Base Score 2.7 (Confidentiality impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:L/I:N/A:N).",
      "severity": 2.7,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Database Server",
          "versions": [
            {
              "version": "23.4",
              "status": "affected",
              "lessThanOrEqual": "23.9",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows high privileged attacker having SYSDBA privilege with network access via Oracle Net to compromise RDBMS Functional Index.  Successful attacks of this vulnerability can result in  unauthorized read access to a subset of RDBMS Functional Index accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-62611",
      "publishedDate": "2025-10-22T19:29:26.708Z",
      "lastModifiedDate": "2025-10-22T19:29:26.708Z",
      "description": "aiomysql is a library for accessing a MySQL database from the asyncio. Prior to version 0.3.0, the client-side settings are not checked before sending local files to MySQL server, which allows obtaining arbitrary files from the client using a rogue server. It is possible to create a rogue MySQL server that emulates authorization, ignores client flags and requests arbitrary files from the client by sending a LOAD_LOCAL instruction packet. This issue has been patched in version 0.3.0.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://github.com/aio-libs/aiomysql/security/advisories/GHSA-r397-ff8c-wv2g",
          "type": "reference"
        },
        {
          "url": "https://github.com/aio-libs/aiomysql/pull/1044",
          "type": "reference"
        },
        {
          "url": "https://github.com/aio-libs/aiomysql/commit/32c4520dae3711367ded74a4726dcb8bb8919538",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "aio-libs",
          "product": "aiomysql",
          "versions": [
            {
              "version": "< 0.3.0",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-73: External Control of File Name or Path"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-59593",
      "publishedDate": "2025-10-22T14:32:39.727Z",
      "lastModifiedDate": "2025-10-22T19:28:44.897Z",
      "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Extend Themes Colibri Page Builder colibri-page-builder allows Stored XSS.This issue affects Colibri Page Builder: from n/a through < 1.0.334.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://vdp.patchstack.com/database/Wordpress/Plugin/colibri-page-builder/vulnerability/wordpress-colibri-page-builder-plugin-1-0-334-cross-site-scripting-xss-vulnerability",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "collectionURL": "https://wordpress.org/plugins",
          "defaultStatus": "unaffected",
          "packageName": "colibri-page-builder",
          "product": "Colibri Page Builder",
          "vendor": "Extend Themes",
          "versions": [
            {
              "changes": [
                {
                  "at": "1.0.334",
                  "status": "unaffected"
                }
              ],
              "lessThanOrEqual": "< 1.0.334",
              "status": "affected",
              "version": "n/a",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}