{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 3,
    "last_updated": "2025-09-22T19:23:44.108053",
    "severity_distribution": {
      "critical": 0,
      "high": 0,
      "medium": 1,
      "low": 0,
      "none": 2
    }
  },
  "cves": [
    {
      "id": "CVE-2025-59433",
      "publishedDate": "2025-09-22T19:14:54.237Z",
      "lastModifiedDate": "2025-09-22T19:14:54.237Z",
      "description": "Conventional Changelog generates changelogs and release notes from a project's commit messages and metadata. Prior to version 2.0.0, @conventional-changelog/git-client has an argument injection vulnerability. This vulnerability manifests with the library's getTags() API, which allows extra parameters to be passed to the git log command. In another API by this library, getRawCommits(), there are secure practices taken to ensure that the extra parameter path is unable to inject an argument by ending the git log command with the special shell syntax --. However, the library does not follow the same practice for getTags() as it does not attempt to sanitize for user input, validate the given params, or restrict them to an allow list. Nor does it properly pass command-line flags to the git binary using the double-dash POSIX characters (--) to communicate the end of options. Thus, allowing users to exploit an argument injection vulnerability in Git due to the --output= command-line option that results with overwriting arbitrary files. This issue has been patched in version 2.0.0.",
      "severity": 5.3,
      "references": [
        {
          "url": "https://github.com/conventional-changelog/conventional-changelog/security/advisories/GHSA-vh25-5764-9wcr",
          "type": "reference"
        },
        {
          "url": "https://github.com/conventional-changelog/conventional-changelog/commit/d95c9ffac05af58228bd89fa0ba37ad65741c6a2",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "conventional-changelog",
          "product": "conventional-changelog",
          "versions": [
            {
              "version": "< 2.0.0",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-88: Improper Neutralization of Argument Delimiters in a Command ('Argument Injection')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-57203",
      "publishedDate": "2025-09-22T00:00:00.000Z",
      "lastModifiedDate": "2025-09-22T19:16:57.880Z",
      "description": "MagicProject AI version 9.1 is affected by a Cross-Site Scripting (XSS) vulnerability within the chatbot generation feature available to authenticated admin users. The vulnerability resides in the prompt parameter submitted to the /dashboard/user/generator/generate-stream endpoint via a multipart/form-data POST request. Due to insufficient input sanitization, attackers can inject HTML-based JavaScript payloads. This payload is stored and rendered unsanitized in subsequent views, leading to execution in other users' browsers when they access affected content. This issue allows an authenticated attacker to execute arbitrary JavaScript in the context of another user, potentially leading to session hijacking, privilege escalation, data exfiltration, or administrative account takeover. The application does not implement a Content Security Policy (CSP) or adequate input filtering to prevent such attacks. A fix should include proper sanitization, output encoding, and strong CSP enforcement to mitigate exploitation.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://codecanyon.net/item/magicai-openai-content-text-image-chat-code-generator-as-saas/45408109",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "n/a",
          "product": "n/a",
          "versions": [
            {
              "version": "n/a",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "n/a"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2022-50403",
      "publishedDate": "2025-09-18T16:03:48.950Z",
      "lastModifiedDate": "2025-09-22T19:12:41.397Z",
      "description": "",
      "severity": "N/A",
      "references": [],
      "affected": [],
      "problemType": [],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}