{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 3,
    "last_updated": "2026-02-24T14:32:40.318798",
    "severity_distribution": {
      "critical": 1,
      "high": 1,
      "medium": 0,
      "low": 0,
      "none": 1
    }
  },
  "cves": [
    {
      "id": "CVE-2026-27208",
      "publishedDate": "2026-02-24T13:52:43.155Z",
      "lastModifiedDate": "2026-02-24T13:52:43.155Z",
      "description": "bleon-ethical/api-gateway-deploy provides API gateway deployment. Version 1.0.0 is vulnerable to an attack chain involving OS Command Injection and Privilege Escalation. This allows an attacker to execute arbitrary commands with root privileges within the container, potentially leading to a container escape and unauthorized infrastructure modifications. This is fixed in version 1.0.1 by implementing strict input sanitization and secure delimiters in entrypoint.sh, enforcing a non-root user (appuser) in the Dockerfile, and establishing mandatory security quality gates.",
      "severity": 9.2,
      "references": [
        {
          "url": "https://github.com/bleon-ethical/api-gateway-deploy/security/advisories/GHSA-chh5-w73q-4gmm",
          "type": "reference"
        },
        {
          "url": "https://github.com/bleon-ethical/api-gateway-deploy/releases/tag/Security",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "bleon-ethical",
          "product": "api-gateway-deploy",
          "versions": [
            {
              "version": "= 1.0.0",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-78: Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')",
        "CWE-88: Improper Neutralization of Argument Delimiters in a Command ('Argument Injection')",
        "CWE-250: Execution with Unnecessary Privileges",
        "CWE-269: Improper Privilege Management"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2026-27483",
      "publishedDate": "2026-02-24T14:00:05.402Z",
      "lastModifiedDate": "2026-02-24T14:00:05.402Z",
      "description": "MindsDB is a platform for building artificial intelligence from enterprise data. Prior to version 25.9.1.1, there is a path traversal vulnerability in Mindsdb's /api/files interface, which an authenticated attacker can exploit to achieve remote command execution. The vulnerability exists in the \"Upload File\" module, which corresponds to the API endpoint /api/files. Since the multipart file upload does not perform security checks on the uploaded file path, an attacker can perform path traversal by using `../` sequences in the filename field. The file write operation occurs before calling clear_filename and save_file, meaning there is no filtering of filenames or file types, allowing arbitrary content to be written to any path on the server. Version 25.9.1.1 patches the issue.",
      "severity": 8.8,
      "references": [
        {
          "url": "https://github.com/mindsdb/mindsdb/security/advisories/GHSA-4894-xqv6-vrfq",
          "type": "reference"
        },
        {
          "url": "https://github.com/mindsdb/mindsdb/commit/87a44bdb2b97f963e18f10a068e1a1e2690505ef",
          "type": "reference"
        },
        {
          "url": "https://github.com/mindsdb/mindsdb/releases/tag/v25.9.1.1",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "mindsdb",
          "product": "mindsdb",
          "versions": [
            {
              "version": "< 25.9.1.1",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-22: Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-10010",
      "publishedDate": "2026-02-24T14:13:29.155Z",
      "lastModifiedDate": "2026-02-24T14:13:29.155Z",
      "description": "The CPSD CryptoPro Secure Disk application boots a small Linux operating system to perform user authentication before using BitLocker to decrypt the Windows partition. The system is located on a separate unencrypted partition which can be reached by anyone with access to the hard disk.\n\nMultiple checks are performed to validate the integrity of the Linux operating system and the CryptoPro Secure Disk application files. When files are changed an error is shown on system start. One of the checks is the Linux kernel's Integrity Measurement Architecture (IMA). It was identified that configuration files are not validated by the IMA and can then (if not checked by other measures) be changed. This allows an attacker to execute arbitrary code in the context of the root user and enables an attacker to e.g., plant a backdoor and access data during execution.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://r.sec-consult.com/cpsd",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "defaultStatus": "unaffected",
          "product": "CryptoPro Secure Disk for BitLocker",
          "vendor": "CPSD IT SERVICES GMBH",
          "versions": [
            {
              "status": "affected",
              "version": "<7.6.6 / 7.7.1"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-353 Missing Support for Integrity Check"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}