{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 2,
    "last_updated": "2025-12-05T19:42:41.730655",
    "severity_distribution": {
      "critical": 0,
      "high": 1,
      "medium": 0,
      "low": 0,
      "none": 1
    }
  },
  "cves": [
    {
      "id": "CVE-2025-14091",
      "publishedDate": "2025-12-05T16:02:06.123Z",
      "lastModifiedDate": "2025-12-05T19:32:33.332Z",
      "description": "A weakness has been identified in TrippWasTaken PHP-Guitar-Shop up to 6ce0868889617c1975982aae6df8e49555d0d555. This vulnerability affects unknown code of the file /product.php of the component Product Details Page. Executing manipulation of the argument ID can lead to sql injection. It is possible to launch the attack remotely. The exploit has been made available to the public and could be exploited. This product takes the approach of rolling releases to provide continious delivery. Therefore, version details for affected and updated releases are not available. The vendor was contacted early about this disclosure but did not respond in any way.",
      "severity": 7.3,
      "references": [
        {
          "url": "https://vuldb.com/?id.334481",
          "type": "reference"
        },
        {
          "url": "https://vuldb.com/?ctiid.334481",
          "type": "reference"
        },
        {
          "url": "https://vuldb.com/?submit.696514",
          "type": "reference"
        },
        {
          "url": "https://github.com/appaxv/report/blob/main/guitarshopsql.docx",
          "type": "poc"
        }
      ],
      "affected": [
        {
          "vendor": "TrippWasTaken",
          "product": "PHP-Guitar-Shop",
          "versions": [
            {
              "version": "6ce0868889617c1975982aae6df8e49555d0d555",
              "status": "affected"
            }
          ],
          "modules": [
            "Product Details Page"
          ]
        }
      ],
      "problemType": [
        "SQL Injection",
        "Injection"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-66471",
      "publishedDate": "2025-12-05T16:06:08.531Z",
      "lastModifiedDate": "2025-12-05T19:33:14.832Z",
      "description": "urllib3 is a user-friendly HTTP client library for Python. Starting in version 1.0 and prior to 2.6.0, the Streaming API improperly handles highly compressed data. urllib3's streaming API is designed for the efficient handling of large HTTP responses by reading the content in chunks, rather than loading the entire response body into memory at once. When streaming a compressed response, urllib3 can perform decoding or decompression based on the HTTP Content-Encoding header (e.g., gzip, deflate, br, or zstd). The library must read compressed data from the network and decompress it until the requested chunk size is met. Any resulting decompressed data that exceeds the requested amount is held in an internal buffer for the next read operation. The decompression logic could cause urllib3 to fully decode a small amount of highly compressed data in a single operation. This can result in excessive resource consumption (high CPU usage and massive memory allocation for the decompressed data.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://github.com/urllib3/urllib3/security/advisories/GHSA-2xpw-w6gg-jr37",
          "type": "reference"
        },
        {
          "url": "https://github.com/urllib3/urllib3/commit/c19571de34c47de3a766541b041637ba5f716ed7",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "urllib3",
          "product": "urllib3",
          "versions": [
            {
              "version": ">= 1.0, < 2.6.0",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-409: Improper Handling of Highly Compressed Data (Data Amplification)"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}