{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 18,
    "last_updated": "2025-10-22T14:52:15.158708",
    "severity_distribution": {
      "critical": 2,
      "high": 2,
      "medium": 12,
      "low": 0,
      "none": 2
    }
  },
  "cves": [
    {
      "id": "CVE-2025-61757",
      "publishedDate": "2025-10-21T20:03:11.303Z",
      "lastModifiedDate": "2025-10-22T14:40:38.263Z",
      "description": "Vulnerability in the Identity Manager product of Oracle Fusion Middleware (component: REST WebServices).  Supported versions that are affected are 12.2.1.4.0 and  14.1.2.1.0. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Identity Manager.  Successful attacks of this vulnerability can result in takeover of Identity Manager. CVSS 3.1 Base Score 9.8 (Confidentiality, Integrity and Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).",
      "severity": 9.8,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Identity Manager",
          "versions": [
            {
              "version": "12.2.1.4.0",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "14.1.2.1.0",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Identity Manager.  Successful attacks of this vulnerability can result in takeover of Identity Manager."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-53037",
      "publishedDate": "2025-10-21T20:02:53.940Z",
      "lastModifiedDate": "2025-10-22T14:41:20.102Z",
      "description": "Vulnerability in the Oracle Financial Services Analytical Applications Infrastructure product of Oracle Financial Services Applications (component: Platform).  Supported versions that are affected are 8.0.7.9, 8.0.8.7 and  8.1.2.5. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Financial Services Analytical Applications Infrastructure.  Successful attacks of this vulnerability can result in takeover of Oracle Financial Services Analytical Applications Infrastructure. CVSS 3.1 Base Score 9.8 (Confidentiality, Integrity and Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).",
      "severity": 9.8,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Financial Services Analytical Applications Infrastructure",
          "versions": [
            {
              "version": "8.0.7.9",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.0.8.7",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.1.2.5",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Financial Services Analytical Applications Infrastructure.  Successful attacks of this vulnerability can result in takeover of Oracle Financial Services Analytical Applications Infrastructure."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-53036",
      "publishedDate": "2025-10-21T20:02:53.596Z",
      "lastModifiedDate": "2025-10-22T14:41:26.008Z",
      "description": "Vulnerability in the Oracle Financial Services Analytical Applications Infrastructure product of Oracle Financial Services Applications (component: Platform).  Supported versions that are affected are 8.0.7.9, 8.0.8.7 and  8.1.2.5. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Financial Services Analytical Applications Infrastructure.  While the vulnerability is in Oracle Financial Services Analytical Applications Infrastructure, attacks may significantly impact additional products (scope change).  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle Financial Services Analytical Applications Infrastructure accessible data. CVSS 3.1 Base Score 8.6 (Confidentiality impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N).",
      "severity": 8.6,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Financial Services Analytical Applications Infrastructure",
          "versions": [
            {
              "version": "8.0.7.9",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.0.8.7",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.1.2.5",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Financial Services Analytical Applications Infrastructure.  While the vulnerability is in Oracle Financial Services Analytical Applications Infrastructure, attacks may significantly impact additional products (scope change).  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle Financial Services Analytical Applications Infrastructure accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-61763",
      "publishedDate": "2025-10-21T20:03:13.622Z",
      "lastModifiedDate": "2025-10-22T14:44:40.195Z",
      "description": "Vulnerability in Oracle Essbase (component: Essbase Web Platform).   The supported version that is affected is 21.7.3.0.0. Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle Essbase.  Successful attacks of this vulnerability can result in  unauthorized creation, deletion or modification access to critical data or all Oracle Essbase accessible data as well as  unauthorized access to critical data or complete access to all Oracle Essbase accessible data. CVSS 3.1 Base Score 8.1 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:N).",
      "severity": 8.1,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Essbase",
          "versions": [
            {
              "version": "21.7.3.0.0",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle Essbase.  Successful attacks of this vulnerability can result in  unauthorized creation, deletion or modification access to critical data or all Oracle Essbase accessible data as well as  unauthorized access to critical data or complete access to all Oracle Essbase accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-53035",
      "publishedDate": "2025-10-21T20:02:53.231Z",
      "lastModifiedDate": "2025-10-22T14:41:31.125Z",
      "description": "Vulnerability in the Oracle Financial Services Analytical Applications Infrastructure product of Oracle Financial Services Applications (component: Platform).  Supported versions that are affected are 8.0.7.9, 8.0.8.7 and  8.1.2.5. Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle Financial Services Analytical Applications Infrastructure.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle Financial Services Analytical Applications Infrastructure accessible data. CVSS 3.1 Base Score 6.5 (Confidentiality impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).",
      "severity": 6.5,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Financial Services Analytical Applications Infrastructure",
          "versions": [
            {
              "version": "8.0.7.9",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.0.8.7",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.1.2.5",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows low privileged attacker with network access via HTTP to compromise Oracle Financial Services Analytical Applications Infrastructure.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all Oracle Financial Services Analytical Applications Infrastructure accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-53060",
      "publishedDate": "2025-10-21T20:03:02.978Z",
      "lastModifiedDate": "2025-10-22T14:40:55.793Z",
      "description": "Vulnerability in the JD Edwards EnterpriseOne Tools product of Oracle JD Edwards (component: Web Runtime SEC).  Supported versions that are affected are 9.2.0.0-9.2.9.4. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise JD Edwards EnterpriseOne Tools.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in JD Edwards EnterpriseOne Tools, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of JD Edwards EnterpriseOne Tools accessible data as well as  unauthorized read access to a subset of JD Edwards EnterpriseOne Tools accessible data. CVSS 3.1 Base Score 6.1 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).",
      "severity": 6.1,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "JD Edwards EnterpriseOne Tools",
          "versions": [
            {
              "version": "9.2.0.0",
              "status": "affected",
              "lessThanOrEqual": "9.2.9.4",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise JD Edwards EnterpriseOne Tools.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in JD Edwards EnterpriseOne Tools, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of JD Edwards EnterpriseOne Tools accessible data as well as  unauthorized read access to a subset of JD Edwards EnterpriseOne Tools accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-53058",
      "publishedDate": "2025-10-21T20:03:02.129Z",
      "lastModifiedDate": "2025-10-22T14:41:08.991Z",
      "description": "Vulnerability in the Oracle Applications Manager product of Oracle E-Business Suite (component: Application Logging Interfaces).  Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Applications Manager.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Applications Manager, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Applications Manager accessible data as well as  unauthorized read access to a subset of Oracle Applications Manager accessible data. CVSS 3.1 Base Score 6.1 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).",
      "severity": 6.1,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Applications Manager",
          "versions": [
            {
              "version": "12.2.3",
              "status": "affected",
              "lessThanOrEqual": "12.2.14",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Applications Manager.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Applications Manager, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Applications Manager accessible data as well as  unauthorized read access to a subset of Oracle Applications Manager accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-53041",
      "publishedDate": "2025-10-21T20:02:54.752Z",
      "lastModifiedDate": "2025-10-22T14:47:19.094Z",
      "description": "Vulnerability in the Oracle iStore product of Oracle E-Business Suite (component: Shopping Cart).  Supported versions that are affected are 12.2.5-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle iStore.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle iStore, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle iStore accessible data as well as  unauthorized read access to a subset of Oracle iStore accessible data. CVSS 3.1 Base Score 6.1 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).",
      "severity": 6.1,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle iStore",
          "versions": [
            {
              "version": "12.2.5",
              "status": "affected",
              "lessThanOrEqual": "12.2.14",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle iStore.  Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle iStore, attacks may significantly impact additional products (scope change). Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle iStore accessible data as well as  unauthorized read access to a subset of Oracle iStore accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-53057",
      "publishedDate": "2025-10-21T20:03:01.717Z",
      "lastModifiedDate": "2025-10-22T14:47:54.864Z",
      "description": "Vulnerability in the Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition product of Oracle Java SE (component: Security).  Supported versions that are affected are Oracle Java SE: 8u461, 8u461-perf, 11.0.28, 17.0.16, 21.0.8, 25; Oracle GraalVM for JDK: 17.0.16 and  21.0.8; Oracle GraalVM Enterprise Edition: 21.3.15. Difficult to exploit vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition.  Successful attacks of this vulnerability can result in  unauthorized creation, deletion or modification access to critical data or all Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition accessible data. Note: This vulnerability can be exploited by using APIs in the specified Component, e.g., through a web service which supplies data to the APIs. This vulnerability also applies to Java deployments, typically in clients running sandboxed Java Web Start applications or sandboxed Java applets, that load and run untrusted code (e.g., code that comes from the internet) and rely on the Java sandbox for security. CVSS 3.1 Base Score 5.9 (Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:N).",
      "severity": 5.9,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Java SE",
          "versions": [
            {
              "version": "8u461",
              "status": "affected"
            },
            {
              "version": "8u461-perf",
              "status": "affected"
            },
            {
              "version": "11.0.28",
              "status": "affected"
            },
            {
              "version": "17.0.16",
              "status": "affected"
            },
            {
              "version": "21.0.8",
              "status": "affected"
            },
            {
              "version": "25",
              "status": "affected"
            }
          ]
        },
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle GraalVM for JDK",
          "versions": [
            {
              "version": "17.0.16",
              "status": "affected"
            },
            {
              "version": "21.0.8",
              "status": "affected"
            }
          ]
        },
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle GraalVM Enterprise Edition",
          "versions": [
            {
              "version": "21.3.15",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "Difficult to exploit vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition.  Successful attacks of this vulnerability can result in  unauthorized creation, deletion or modification access to critical data or all Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-53061",
      "publishedDate": "2025-10-21T20:03:03.351Z",
      "lastModifiedDate": "2025-10-22T14:40:50.163Z",
      "description": "Vulnerability in the PeopleSoft Enterprise PeopleTools product of Oracle PeopleSoft (component: PIA Core Technology).  Supported versions that are affected are 8.60, 8.61 and  8.62. Easily exploitable vulnerability allows high privileged attacker with network access via HTTP to compromise PeopleSoft Enterprise PeopleTools.  While the vulnerability is in PeopleSoft Enterprise PeopleTools, attacks may significantly impact additional products (scope change).  Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of PeopleSoft Enterprise PeopleTools accessible data as well as  unauthorized read access to a subset of PeopleSoft Enterprise PeopleTools accessible data. CVSS 3.1 Base Score 5.5 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:C/C:L/I:L/A:N).",
      "severity": 5.5,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "PeopleSoft Enterprise PeopleTools",
          "versions": [
            {
              "version": "8.60",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.61",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.62",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows high privileged attacker with network access via HTTP to compromise PeopleSoft Enterprise PeopleTools.  While the vulnerability is in PeopleSoft Enterprise PeopleTools, attacks may significantly impact additional products (scope change).  Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of PeopleSoft Enterprise PeopleTools accessible data as well as  unauthorized read access to a subset of PeopleSoft Enterprise PeopleTools accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-53034",
      "publishedDate": "2025-10-21T20:02:52.854Z",
      "lastModifiedDate": "2025-10-22T14:41:36.407Z",
      "description": "Vulnerability in the Oracle Financial Services Analytical Applications Infrastructure product of Oracle Financial Services Applications (component: Platform).  Supported versions that are affected are 8.0.7.9, 8.0.8.7 and  8.1.2.5. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Financial Services Analytical Applications Infrastructure.  Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Financial Services Analytical Applications Infrastructure accessible data as well as  unauthorized read access to a subset of Oracle Financial Services Analytical Applications Infrastructure accessible data. CVSS 3.1 Base Score 5.4 (Confidentiality and Integrity impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:N).",
      "severity": 5.4,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle Financial Services Analytical Applications Infrastructure",
          "versions": [
            {
              "version": "8.0.7.9",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.0.8.7",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.1.2.5",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Financial Services Analytical Applications Infrastructure.  Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in  unauthorized update, insert or delete access to some of Oracle Financial Services Analytical Applications Infrastructure accessible data as well as  unauthorized read access to a subset of Oracle Financial Services Analytical Applications Infrastructure accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-62477",
      "publishedDate": "2025-10-21T20:03:17.583Z",
      "lastModifiedDate": "2025-10-22T14:40:25.620Z",
      "description": "Vulnerability in the Oracle ZFS Storage Appliance Kit product of Oracle Systems (component: Remote Replication).   The supported version that is affected is 8.8. Easily exploitable vulnerability allows high privileged attacker with network access via HTTP to compromise Oracle ZFS Storage Appliance Kit.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of Oracle ZFS Storage Appliance Kit. CVSS 3.1 Base Score 4.9 (Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).",
      "severity": 4.9,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle ZFS Storage Appliance Kit",
          "versions": [
            {
              "version": "8.8",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows high privileged attacker with network access via HTTP to compromise Oracle ZFS Storage Appliance Kit.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of Oracle ZFS Storage Appliance Kit."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-62475",
      "publishedDate": "2025-10-21T20:03:16.833Z",
      "lastModifiedDate": "2025-10-22T14:40:31.636Z",
      "description": "Vulnerability in the Oracle ZFS Storage Appliance Kit product of Oracle Systems (component: Core).   The supported version that is affected is 8.8. Easily exploitable vulnerability allows high privileged attacker with network access via HTTP to compromise Oracle ZFS Storage Appliance Kit.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of Oracle ZFS Storage Appliance Kit. CVSS 3.1 Base Score 4.9 (Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).",
      "severity": 4.9,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "Oracle ZFS Storage Appliance Kit",
          "versions": [
            {
              "version": "8.8",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows high privileged attacker with network access via HTTP to compromise Oracle ZFS Storage Appliance Kit.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of Oracle ZFS Storage Appliance Kit."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-53062",
      "publishedDate": "2025-10-21T20:03:03.708Z",
      "lastModifiedDate": "2025-10-22T14:40:44.650Z",
      "description": "Vulnerability in the MySQL Server product of Oracle MySQL (component: InnoDB).  Supported versions that are affected are 8.0.0-8.0.43, 8.4.0-8.4.6 and  9.0.0-9.4.0. Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.1 Base Score 4.9 (Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).",
      "severity": 4.9,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "MySQL Server",
          "versions": [
            {
              "version": "8.0.0",
              "status": "affected",
              "lessThanOrEqual": "8.0.43",
              "versionType": "custom"
            },
            {
              "version": "8.4.0",
              "status": "affected",
              "lessThanOrEqual": "8.4.6",
              "versionType": "custom"
            },
            {
              "version": "9.0.0",
              "status": "affected",
              "lessThanOrEqual": "9.4.0",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-53059",
      "publishedDate": "2025-10-21T20:03:02.603Z",
      "lastModifiedDate": "2025-10-22T14:41:02.491Z",
      "description": "Vulnerability in the PeopleSoft Enterprise PeopleTools product of Oracle PeopleSoft (component: OpenSearch Dashboards).  Supported versions that are affected are 8.60, 8.61 and  8.62. Easily exploitable vulnerability allows high privileged attacker with network access via HTTP to compromise PeopleSoft Enterprise PeopleTools.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all PeopleSoft Enterprise PeopleTools accessible data. CVSS 3.1 Base Score 4.9 (Confidentiality impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N).",
      "severity": 4.9,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "PeopleSoft Enterprise PeopleTools",
          "versions": [
            {
              "version": "8.60",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.61",
              "status": "affected",
              "versionType": "semver"
            },
            {
              "version": "8.62",
              "status": "affected",
              "versionType": "semver"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows high privileged attacker with network access via HTTP to compromise PeopleSoft Enterprise PeopleTools.  Successful attacks of this vulnerability can result in  unauthorized access to critical data or complete access to all PeopleSoft Enterprise PeopleTools accessible data."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-53040",
      "publishedDate": "2025-10-21T20:02:54.332Z",
      "lastModifiedDate": "2025-10-22T14:41:14.519Z",
      "description": "Vulnerability in the MySQL Server product of Oracle MySQL (component: Server: Optimizer).  Supported versions that are affected are 8.0.0-8.0.43, 8.4.0-8.4.6 and  9.0.0-9.4.0. Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.1 Base Score 4.9 (Availability impacts).  CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).",
      "severity": 4.9,
      "references": [
        {
          "url": "https://www.oracle.com/security-alerts/cpuoct2025.html",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "Oracle Corporation",
          "product": "MySQL Server",
          "versions": [
            {
              "version": "8.0.0",
              "status": "affected",
              "lessThanOrEqual": "8.0.43",
              "versionType": "custom"
            },
            {
              "version": "8.4.0",
              "status": "affected",
              "lessThanOrEqual": "8.4.6",
              "versionType": "custom"
            },
            {
              "version": "9.0.0",
              "status": "affected",
              "lessThanOrEqual": "9.4.0",
              "versionType": "custom"
            }
          ]
        }
      ],
      "problemType": [
        "Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server.  Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server."
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-11966",
      "publishedDate": "2025-10-22T14:44:24.145Z",
      "lastModifiedDate": "2025-10-22T14:44:24.145Z",
      "description": "In Eclipse Vert.x versions [4.0.0, 4.5.21] and [5.0.0, 5.0.4], when \"directory listing\" is enabled, file and directory names are inserted into generated HTML without proper escaping in the href, title, and link attributes. An attacker who can create or rename files or directories within a served path can craft filenames containing malicious script or HTML content, leading to stored cross-site scripting (XSS) that executes in the context of users viewing the affected directory listing.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://gitlab.eclipse.org/security/vulnerability-reports/-/issues/303",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "defaultStatus": "unaffected",
          "product": "Vert.x",
          "vendor": "Eclipse Foundation",
          "versions": [
            {
              "lessThan": "4.5.22",
              "status": "affected",
              "version": "4.0.0",
              "versionType": "maven"
            },
            {
              "lessThan": "5.0.5",
              "status": "affected",
              "version": "5.0.0",
              "versionType": "maven"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-79 Improper Neutralization of Input During Web Page Generation (XSS or 'Cross-site Scripting')",
        "CWE-80 Improper Neutralization of Script-Related HTML Tags in a Web Page (Basic XSS)"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-60332",
      "publishedDate": "2025-10-22T00:00:00.000Z",
      "lastModifiedDate": "2025-10-22T14:45:08.507Z",
      "description": "A NULL pointer dereference in the SetWLanRadioSettings function of D-Link DIR-823G A1 v1.0.2B05 allows attackers to cause a Denial of Service (DoS) via a crafted HTTP request.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.dlink.com/en/security-bulletin/",
          "type": "reference"
        },
        {
          "url": "https://github.com/z472421519/BinaryAudit/blob/main/PoC/NPD/DIR823G/SetWLanRadioSetting.md",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "n/a",
          "product": "n/a",
          "versions": [
            {
              "version": "n/a",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "n/a"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}