{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 7,
    "last_updated": "2026-01-01T18:50:58.625070",
    "severity_distribution": {
      "critical": 1,
      "high": 3,
      "medium": 2,
      "low": 0,
      "none": 1
    }
  },
  "cves": [
    {
      "id": "CVE-2025-68620",
      "publishedDate": "2026-01-01T18:29:35.761Z",
      "lastModifiedDate": "2026-01-01T18:29:35.761Z",
      "description": "Signal K Server is a server application that runs on a central hub in a boat. Versions prior to 2.19.0 expose two features that can be chained together to steal JWT authentication tokens without any prior authentication. The attack combines WebSocket-based request enumeration with unauthenticated polling of access request status. The first is Unauthenticated WebSocket Request Enumeration: When a WebSocket client connects to the SignalK stream endpoint with the `serverevents=all` query parameter, the server sends all cached server events including `ACCESS_REQUEST` events that contain details about pending access requests. The `startServerEvents` function iterates over `app.lastServerEvents` and writes each cached event to any connected client without verifying authorization level. Since WebSocket connections are allowed for readonly users (which includes unauthenticated users when `allow_readonly` is true), attackers receive these events containing request IDs, client identifiers, descriptions, requested permissions, and IP addresses. The second is Unauthenticated Token Polling: The access request status endpoint at `/signalk/v1/access/requests/:id` returns the full state of an access request without requiring authentication. When an administrator approves a request, the response includes the issued JWT token in plaintext. The `queryRequest` function returns the complete request object including the token field, and the REST endpoint uses readonly authentication, allowing unauthenticated access. An attacker has two paths to exploit these vulnerabilities. Either the attacker creates their own access request (using the IP spoofing vulnerability to craft a convincing spoofed request), then polls their own request ID until an administrator approves it, receiving the JWT token; or the attacker passively monitors the WebSocket stream to discover request IDs from legitimate devices, then polls those IDs and steals the JWT tokens when administrators approve them, hijacking legitimate device credentials. Both paths require zero authentication and enable complete authentication bypass. Version 2.19.0 fixes the underlying issues.",
      "severity": 9.1,
      "references": [
        {
          "url": "https://github.com/SignalK/signalk-server/security/advisories/GHSA-fq56-hvg6-wvm5",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "SignalK",
          "product": "signalk-server",
          "versions": [
            {
              "version": "< 2.19.0",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-288: Authentication Bypass Using an Alternate Path or Channel"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-55065",
      "publishedDate": "2026-01-01T18:30:45.844Z",
      "lastModifiedDate": "2026-01-01T18:30:45.844Z",
      "description": "CWE-89 Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')",
      "severity": 7.5,
      "references": [
        {
          "url": "https://www.gov.il/en/departments/dynamiccollectors/cve_advisories_listing?skip=0",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "defaultStatus": "unaffected",
          "platforms": [
            "Windows"
          ],
          "product": "ReKord client",
          "vendor": "Kopek Reem",
          "versions": [
            {
              "status": "affected",
              "version": "latest"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-89 Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-68272",
      "publishedDate": "2026-01-01T18:08:06.947Z",
      "lastModifiedDate": "2026-01-01T18:38:40.802Z",
      "description": "Signal K Server is a server application that runs on a central hub in a boat. A Denial of Service (DoS) vulnerability in versions prior to 2.19.0 allows an unauthenticated attacker to crash the SignalK Server by flooding the access request endpoint (`/signalk/v1/access/requests`). This causes a \"JavaScript heap out of memory\" error due to unbounded in-memory storage of request objects. Version 2.19.0 fixes the issue.",
      "severity": 7.5,
      "references": [
        {
          "url": "https://github.com/SignalK/signalk-server/security/advisories/GHSA-7rqc-ff8m-7j23",
          "type": "reference"
        },
        {
          "url": "https://github.com/SignalK/signalk-server/releases/tag/v2.19.0",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "SignalK",
          "product": "signalk-server",
          "versions": [
            {
              "version": "< 2.19.0",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-400: Uncontrolled Resource Consumption",
        "CWE-770: Allocation of Resources Without Limits or Throttling"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-15409",
      "publishedDate": "2026-01-01T18:32:06.837Z",
      "lastModifiedDate": "2026-01-01T18:32:06.837Z",
      "description": "A vulnerability was determined in code-projects Online Guitar Store 1.0. Affected by this vulnerability is an unknown functionality of the file /admin/Delete_product.php. Executing manipulation of the argument del_pro can lead to sql injection. The attack may be performed from remote. The exploit has been publicly disclosed and may be utilized.",
      "severity": 7.3,
      "references": [
        {
          "url": "https://vuldb.com/?id.339329",
          "type": "reference"
        },
        {
          "url": "https://vuldb.com/?ctiid.339329",
          "type": "reference"
        },
        {
          "url": "https://vuldb.com/?submit.728393",
          "type": "reference"
        },
        {
          "url": "https://github.com/jjjjj-zr/jjjjjzr19/issues/3",
          "type": "poc"
        },
        {
          "url": "https://code-projects.org/",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "code-projects",
          "product": "Online Guitar Store",
          "versions": [
            {
              "version": "1.0",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "SQL Injection",
        "Injection"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-69203",
      "publishedDate": "2026-01-01T18:37:11.015Z",
      "lastModifiedDate": "2026-01-01T18:37:11.015Z",
      "description": "Signal K Server is a server application that runs on a central hub in a boat. Versions prior to 2.19.0 of the access request system have two related features that when combined by themselves and with an information disclosure vulnerability enable convincing social engineering attacks against administrators. When a device creates an access request, it specifies three fields: `clientId`, `description`, and `permissions`. The SignalK admin UI displays the `description` field prominently to the administrator when showing pending requests, but the actual `permissions` field (which determines the access level granted) is less visible or displayed separately. This allows an attacker to request `admin` permissions while providing a description that suggests readonly access. The access request handler trusts the `X-Forwarded-For` HTTP header without validation to determine the client's IP address. This header is intended to preserve the original client IP when requests pass through reverse proxies, but when trusted unconditionally, it allows attackers to spoof their IP address. The spoofed IP is displayed to administrators in the access request approval interface, potentially making malicious requests appear to originate from trusted internal network addresses. Since device/source names can be enumerated via the information disclosure vulnerability, an attacker can impersonate a legitimate device or source, craft a convincing description, spoof a trusted internal IP address, and request elevated permissions, creating a highly convincing social engineering scenario that increases the likelihood of administrator approval. Users should upgrade to version 2.19.0 to fix this issue.",
      "severity": 6.3,
      "references": [
        {
          "url": "https://github.com/SignalK/signalk-server/security/advisories/GHSA-vfrf-vcj7-wvr8",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "SignalK",
          "product": "signalk-server",
          "versions": [
            {
              "version": "< 2.19.0",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-290: Authentication Bypass by Spoofing"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-68273",
      "publishedDate": "2026-01-01T18:21:51.678Z",
      "lastModifiedDate": "2026-01-01T18:40:25.139Z",
      "description": "Signal K Server is a server application that runs on a central hub in a boat. An unauthenticated information disclosure vulnerability in versions prior to 2.19.0 allows any user to retrieve sensitive system information, including the full SignalK data schema, connected serial devices, and installed analyzer tools. This exposure facilitates reconnaissance for further attacks. Version 2.19.0 patches the issue.",
      "severity": 5.3,
      "references": [
        {
          "url": "https://github.com/SignalK/signalk-server/security/advisories/GHSA-fpf5-w967-rr2m",
          "type": "reference"
        },
        {
          "url": "https://github.com/SignalK/signalk-server/releases/tag/v2.19.0",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "SignalK",
          "product": "signalk-server",
          "versions": [
            {
              "version": "< 2.19.0",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-200: Exposure of Sensitive Information to an Unauthorized Actor"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-68619",
      "publishedDate": "2026-01-01T18:35:19.982Z",
      "lastModifiedDate": "2026-01-01T18:35:19.982Z",
      "description": "Signal K Server is a server application that runs on a central hub in a boat. Versions prior to 2.19.0 of the appstore interface allow administrators to install npm packages through a REST API endpoint. While the endpoint validates that the package name exists in the npm registry as a known plugin or webapp, the version parameter accepts arbitrary npm version specifiers including URLs. npm supports installing packages from git repositories, GitHub shorthand syntax, and HTTP/HTTPS URLs pointing to tarballs. When npm installs a package, it can automatically execute any `postinstall` script defined in `package.json`, enabling arbitrary code execution. The vulnerability exists because npm's version specifier syntax is extremely flexible, and the SignalK code passes the version parameter directly to npm without sanitization. An attacker with admin access can install a package from an attacker-controlled source containing a malicious `postinstall` script. Version 2.19.0 contains a patch for the issue.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://github.com/SignalK/signalk-server/security/advisories/GHSA-93jc-vqqc-vvvh",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "SignalK",
          "product": "signalk-server",
          "versions": [
            {
              "version": "< 2.19.0",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-94: Improper Control of Generation of Code ('Code Injection')"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}