{
  "dataType": "CVE_RECORD",
  "dataVersion": "5.1",
  "cveMetadata": {
    "total_count": 4,
    "last_updated": "2025-11-13T03:20:09.142775",
    "severity_distribution": {
      "critical": 0,
      "high": 0,
      "medium": 0,
      "low": 1,
      "none": 3
    }
  },
  "cves": [
    {
      "id": "CVE-2025-64711",
      "publishedDate": "2025-11-13T01:50:31.780Z",
      "lastModifiedDate": "2025-11-13T01:50:31.780Z",
      "description": "PrivateBin is an online pastebin where the server has zero knowledge of pasted data. Starting in version 1.7.7 and prior to version 2.0.3, dragging a file whose filename contains HTML is reflected verbatim into the page via the drag-and-drop helper, so any user who drops a crafted file on PrivateBin will execute arbitrary JavaScript within their own session (self-XSS). This allows an attacker who can entice a victim to drag or otherwise attach such a file to exfiltrate plaintext, encryption keys, or stored pastes before they are encrypted or sent. Certain conditions must exist for the vulnerability to be exploitable. Only macOS or Linux users are affected, due to the way the `>` character is treated in a file name on Windows. The PrivateBin instance needs to have file upload enabled. An attacker needs to have access to the local file system or somehow convince the user to create (or download) a malicious file (name). An attacker needs to convince the user to attach that malicious file to PrivateBin. Any Mac / Linux user who can be tricked into dragging a maliciously named file into the editor is impacted; code runs in the origin of the PrivateBin instance they are using. Attackers can steal plaintext, passphrases, or manipulate the UI before data is encrypted, defeating the zero-knowledge guarantees for that victim session, assuming counter-measures like Content-Security-Policy (CSP) have been disabled. If CSP is not disabled, HTML injection attacks may be possible - like redirecting to a foreign website, phishing etc. As the whole exploit needs to be included in the file name of the attached file and only affects the local session of the user (aka it is neither persistent nor remotely executable) and that user needs to interact and actively attach that file to the paste, the impact is considered to be practically low. Version 2.0.3 patches the issue.",
      "severity": 3.9,
      "references": [
        {
          "url": "https://github.com/PrivateBin/PrivateBin/security/advisories/GHSA-r9x7-7ggj-fx9f",
          "type": "reference"
        },
        {
          "url": "https://github.com/PrivateBin/PrivateBin/commit/f9550e513381208b36595ee2404e968144bba78b",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "PrivateBin",
          "product": "PrivateBin",
          "versions": [
            {
              "version": ">= 1.7.7, < 2.0.3",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-59367",
      "publishedDate": "2025-11-13T02:09:55.309Z",
      "lastModifiedDate": "2025-11-13T02:09:55.309Z",
      "description": "An authentication bypass vulnerability has been identified in certain DSL series routers, may allow remote attackers to gain unauthorized access into the affected system. Refer to the 'Security Update for DSL Series Router' section on the ASUS Security Advisory for more information.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://www.asus.com/security-advisory",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "defaultStatus": "unaffected",
          "product": "DSL-AC51",
          "vendor": "ASUS",
          "versions": [
            {
              "status": "affected",
              "version": "Before 1.1.2.3_1010"
            }
          ]
        },
        {
          "defaultStatus": "unaffected",
          "product": "DSL-N16",
          "vendor": "ASUS",
          "versions": [
            {
              "status": "affected",
              "version": "Before 1.1.2.3_1010"
            }
          ]
        },
        {
          "defaultStatus": "unaffected",
          "product": "DSL-AC750",
          "vendor": "ASUS",
          "versions": [
            {
              "status": "affected",
              "version": "Before 1.1.2.3_1010"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-288: Authentication Bypass by Alternate Path or Channel"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-64716",
      "publishedDate": "2025-11-13T01:46:19.982Z",
      "lastModifiedDate": "2025-11-13T01:46:19.982Z",
      "description": "Anubis is a Web AI Firewall Utility that challenges users' connections in order to protect upstream resources from scraper bots. Prior to version 1.23.0, when using subrequest authentication, Anubis did not perform validation of the redirect URL and redirects user to any URL scheme. While most modern browsers do not allow a redirect to `javascript:` URLs, it could still trigger dangerous behavior in some cases. Anybody with a subrequest authentication may be affected. Version 1.23.0 contains a fix for the issue.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://github.com/TecharoHQ/anubis/security/advisories/GHSA-cf57-c578-7jvv",
          "type": "reference"
        },
        {
          "url": "https://github.com/TecharoHQ/anubis/commit/7ed1753fcced351c81961bf520a7bfb2caac6e88",
          "type": "reference"
        },
        {
          "url": "https://pkg.go.dev/vuln/GO-2025-4086",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "TecharoHQ",
          "product": "anubis",
          "versions": [
            {
              "version": "< 1.23.0",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')",
        "CWE-601: URL Redirection to Untrusted Site ('Open Redirect')"
      ],
      "fix_suggestion": "无法生成修复建议"
    },
    {
      "id": "CVE-2025-64710",
      "publishedDate": "2025-11-13T01:40:55.653Z",
      "lastModifiedDate": "2025-11-13T01:40:55.653Z",
      "description": "Bitplatform Boilerplate is a Visual studio and .NET project template. Versions prior to 9.11.3 are affected by a cross-site scripting (XSS) vulnerability in the WebInteropApp/WebAppInterop, potentially allowing attackers to inject malicious scripts that compromise the security and integrity of web applications. Applications based on this Bitplatform Boilerplate might also be vulnerable. Version 9.11.3 fixes the issue.",
      "severity": "N/A",
      "references": [
        {
          "url": "https://github.com/bitfoundation/bitplatform/security/advisories/GHSA-rv95-xj37-7c3w",
          "type": "reference"
        }
      ],
      "affected": [
        {
          "vendor": "bitfoundation",
          "product": "bitplatform",
          "versions": [
            {
              "version": "< 9.11.3",
              "status": "affected"
            }
          ]
        }
      ],
      "problemType": [
        "CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')"
      ],
      "fix_suggestion": "无法生成修复建议"
    }
  ]
}